Ask around for a spare disk. Offer $2. Keep asking until someone agrees. Then, pull a disk out of your pocket and say, "Oops, I forgot."
Ask the person next to you if they know how to tap into top-secret Pentagon files.
Assign a musical note to every key (ie. the Delete key is A Flat, the B key is F sharp, etc.). Whenever you hit a key, hum its note loudly. Write an entire paper this way.
Attempt to eat your computer's mouse.
Before anyone else is in the lab, connect each computer to different screen than the one it's set up with.
Borrow someone else's keyboard by reaching over, saying "Excuse me, mind if I borrow this for a sec?", unplugging the keyboard & taking it.
Bring a chainsaw, but don't use it. If anyone asks why you have it, say "Just in case..." mysteriously.
Bring an small tape player with a tape of really absurd sound effects.
Bring in a bunch of magnets and have fun.
Bring some dry ice & make it look like your computer is smoking.
Come into the computer lab wearing several endangered species of flowers in your hair. Smile incessantly. Type a sentence, then laugh happily, exclaim "You're such a marvel!!", and kiss the screen. Repeat this after every sentence. As your ecstasy mounts, also hug the keyboard. Finally, hug your neighbor, then the computer assistant, and walk out.
Come to the lab wearing several layers of socks. Remove shoes and place them of top of the monitor. Remove socks layer by layer and drape them around the monitor. Exclaim sudden haiku about the aesthetic beauty of cotton on plastic.
Draw a picture of a woman (or man) on a piece of paper, tape it to your monitor. Try to seduce it. Act like it hates you and then complain loudly that women (men) are worthless.
Enter the lab, undress, and start staring at other people as if they're crazy while typing.
Every time you press Return and there is processing time required, pray "Ohpleaseohpleaseohpleaseohplease," and scream "YES!" when it finishes.
If you have long hair, take a typing break, look for split ends, cut them and deposit them on your neighbor's keyboard as you leave.
If you're sitting in a swivel chair, spin around singing "The Lion Sleeps Tonight" whenever there is processing time required.
Keep looking at invisible bugs and trying to swat them.
Laugh hysterically, shout "You will all perish in flames!!!" and continue working.
Laugh uncontrollably for about 3 minutes & then suddenly stop and look suspiciously at everyone who looks at you.
Light candles in a circle around your terminal before starting.
Log on, wait a sec, then get a frightened look on your face and scream "NO!!! They've found me!" and bolt.
Make a loud noise of hitting the same key over and over again until you see that your neighbor is noticing (You can hit the space bar so your fill isn't affected). Then look at your neighbor's keyboard. Hit his/her delete key several times, erasing an entire word.
Make a small ritual sacrifice to the computer before you turn it on.
Play "Pong" for hours on the most powerful computer in the lab.
Point at the screen. Chant in a made up language while making elaborate hand gestures for a minute or two. Press return or the mouse, then leap back and yell "COVEEEEERRRRRR!" peek up from under the table, walk back to the computer and say. "Oh, good. It worked this time," and calmly start to type again.
Pretend it's the computer and look really lost.
Print out the complete works of Shakespeare, then when its all done (two days later) say that all you wanted was one line.
Pull out a pencil. Start writing on the screen. Complain that the lead doesn't work.
Put a large, gold-framed portrait of the British Royal Family on your desk and loudly proclaim that it inspires you.
Put a straw in your mouth and put your hands in your pockets. Type by hitting the keys with the straw.
Quietly walk into the computer lab with a Black and Decker chainsaw, rev that baby up, and then walk up to the nearest person and say, "Give me that computer or you'll be feeding my pet crocodile for the next week".
Remove your disk from the drive and hide it. Go to the lab monitor and complain that your computer ate your disk. (For special effects, put some Elmer's Glue on or around the disk drive. Claim that the computer is drooling.)
Run into the computer lab, shout "Armageddon is here!!!!!", then calmly sit down and begin to type.
See who's online. Send a total stranger a talk request. Talk to them like you've known them all your lives. Hangup before they geta chance to figure out you're a total stranger.
Sit and stare at the screen, biting your nails noisily. After doing this for a while, spit them out at the feet of the person next to you.
Stare at the person's next to your's screen, look really puzzled, burst out laughing, and say "You did that?" loudly. Keep laughing, grab your stuff and leave, howling as you go.
Stare at the screen, grind your teeth, stop, look at the person next to grinding. Repeat procedure, making sure you never provoke the person enough to let them blow up, as this releases tension, and it is far more effective to let them linger.
Start making out with the person at the terminal next to you (It helps if you know them, but this is also a great way to make new friends).
Take the keyboard and sit under the computer. Type up your paper like this. Then go to the lab supervisor and complain about the bad working conditions.
Try to stick a Nintendo cartridge into the 3 1/2 disc drive, when it doesn't work, get the supervisor.
Two words: Tesla Coil.
Type frantically, often stopping to look at the person next to you evilly.
Type on VAX for a while. Suddenly start cursing for 3 minutes at everything bad about your life. Then stop and continue typing.
Use Interactive Send to make passes at people you don't know.
When doing calculations, pull out an abacus and say that sometimes the old ways are best.
When you are on an IBM, and when you turn it on, ask loudly where the smiling Apple face is when you turn on one of those.
When your computer is turned off, complain to the monitor on duty that you can't get the darn thing to work. After he/she's turned it on, wait 5 minutes, turn it off again, & repeat the process for a good half hour.
Work normally for a while. Suddenly look amazingly startled by something on the screen and crawl underneath the desk.
Write a program that plays the "Smurfs" theme song and play it at the highest volume possible over & over again.
Yell "DISK FIGHT!!!"
-::-::-::-::-::-::-::-::-::-::BEACH::-::-::-::-::-::-::-::-::-::-::-
Ask everyone you meet, "Hot enough for you?"
Sing the "Barney" theme song as loud as you can.
If you see kids building a sand castle, say, "That's not a real castle!"
Every time when you're about to duck under the water, yell, "Down periscope!"
Go swimming in a full business suit. If people notice, act like they're the weirdos.
Put sea shell to your ear and announce to first person to pass by, "It's for you!" Repeat several times.
Throw jellyfish around.
Tune radio to all-news station and blast as loud as you can, then nod your head and snap your fingers like you're listening to some happenin' tunes.
Act like a sea gull.
Wear t-shirt that says, "I'm the coolest dude on this pathetic beach. No autographs please."
-::-::-::-::-::-::-::-::-::-::ammusement park::-::-::-::-::-::-::-::-::-
Dress up like one of the photographers and follow people around asking them repeatly if they would like their picture taken.
Leave large gaps in between you and the people in front of you while waiting in line.
Everytime you pass a chain restraint not in use, clip it on and use it to hold back the people behind you in line.
Ask the person running the roller coaster if someone has recently thrown up on it.
Pretend to freak out on a ride so they stop it to let you off.
Offer people money for their spots in line...MONOPOLY money.
Speak in Spanish, or pretend you're deaf and start making rapid hand movements.
Start talking about shaving your excess body hair in line while everyone around you is silent.
Find someone and tell them you're lost. Use your best acting skills.
Steal all of the pennies out of the water fountains.
Go up to the boy band wanna-be group and pretend to be really excited and ask for their autographs, reassuring them that they're gonna make it big soon.
Take an Alka-Seltzer tablet and begin to have spasmatic movements in your body while foaming at the mouth at the very top of the tallest ride.
Ask the ride attendant if you cannot ride because you are under the influence of herione, marijuana, crack, and every other drug you can think of.
Begin to cry when they start the merry-go-round and have them stop it because you're too scared to go all the way.
Start talking *loudly* about the last time you got stuck upside-down on this ride, scaring everyone in line around you.
Ask someone that looks like they're in a hurry for directions.
Complain about how dirty the seat is, and demand they clean it off.
Walk up to anyone in the park, and say "Hi, my name is [your name]" and offer a handshake.
Ask ANYONE for their autograph.
Advertise for a theme park...one you're not at.
Find someone to tell your life story to.
Whisper right in someone's ear, "I know what you did last summer."
Comment how good you look in every picture of you on a ride.
Make fun of everyone else in every set of pictures taken during the rides.
Go up to every character walking around and give them a big hug and call them your "hero."
Ride every water ride and inform everybody with you that you can’t swim and everyone's gonna drown.
-::-::-::-::-::-::-::-::-::-::-::-::TRAIN::-::-::-::-::-::-::-::-::-::-::-::-
Take large objects on the train with you.
Sing songs. Start a round with everyone on the train.
Eat onions and garlic and talk to the people next to you.
Sell stuff.
Stand in front of the doorway and glare at people when they try to get by.
Yell to your friends at the other end of the train.
Make fun of other people while they are in hearing distance of you.
Ride the train while drunk. Extra points if you throw up.
Constantly ask people for directions.
Ask people where they are from.
Ask people where they are going.
Quiz people on the meaning of life.
Start a game of poker. Extra points if it's strip poker.
Start a game of tag. Extra points if it's strip tag.
Start a game of twister.
Use a cell phone. Talk loudly.
Turn your headphones up to 120 decibels and then complain loudly that they just don't make headphones loud enough anymore.
Shake off your umbrella on the people sitting down.
Shake off your hair on the people sitting down.
Ring out your shirt on the people sitting down. Even on days when it's not raining. Make them wonder where it all came from.
Ring out the shirt of the person sitting next to you.
Bring a pet. Preferable a rattlesnake. Without a cage.
Juggle eggs.
Juggle knives.
Don't take a shower for a month.
Stick your feet way out into the aisles when sitting down. Extra points if you're wearing clown shoes.
Tell the people your problems. They really want to know.
Start line dancing. Even when there's no music.
Use the shoulder of the person next to you to take a nap.
Use the shoulder of the person next to you to blow your nose.
Use the shoulder of the person next to you to cry.
Have deep philosophical conversations about belly button lint.
Play an accordion for money. Make people pay you to stop.
Jump up and down muttering "gotta go, gotta go" then frown and say "oops."
Use pennies in the turnstile.
Where a Burger King crown and tell everyone that they must bow before royalty. Hit those who don't.
-::-::-::-::-::-::-::-::-::-::-::-::-office-::-::-::-::-::-::-::-::-::-::-::-::
“Hi-lite” your shoes. Tell people that you haven’t lost your shoes since you did this.
Agree to organize the company Christmas party. Hold it at McDonald’s Playland. Charge everyone $15 each.
Arrive at a meeting late, say you’re sorry, but you didn’t have time for lunch, and you’re going to be nibbling during the meeting. During the meeting eat entire raw potatoes.
Attach a sign that says "FAX" to the paper shredder. Sit and watch to see how many people fall for it.
Bring in dishes that you tried to cook but didn’t turn out quite right as special treats for your co-workers.
Build models of the Seven Wonders of the World using empty soda cans.
Change the message on the company voice mail system. Get “Creative”.
Compose all your e-mail in rhyming couplets.
Decorate your office with pictures of Cindy Brady and Danny Partridge. Try to pass them off as your children.
Determine how many cups of coffee is “too many.”
Develop an unnatural fear of staplers.
Develop an unnatural fear of staplers.
Email your boss the message: I know what you did last vacation.
Encourage your colleagues to join you in a little synchronized chair dancing.
Erect a shrine to your favorite sports team, holding candlelight vigils at 10:00 a.m. and 2:00 p.m. daily.
Every time someone asks you to do something, ask them if they want fries with that.
Find out where your boss shops and buy exactly the same outfits. Always wear them one day after your boss does. (This is especially effective if your boss is a different gender than you are.)
For a relaxing break, get away from it all with a mask and snorkel in the fish tank. If no one notices, take out your snorkel and see how many you can catch in your mouth.
Grow mold in your coffee cup.
Hang mistletoe over your desk.
Hide a rubber cockroach in inventive places.
Include a piece of your children’s artwork as a cover page for all reports that you write. (If you don’t have children, draw stick figures yourself.)
Insist that your e-mail address be: “zena_goddess_of_fire@companyname.com” (or “thor_god_of_thunder@companyname.com”)
Install a set of buttons and lights in the arm of your chair. Talk into your daytimer.
Make a roof over your cubical out of old soda cans.
Make up nicknames for all your coworkers and refer to them only by these names. “That’s a good point Sparky.” “No I’m sorry I’m going to have to disagree with you there, Chachi.”
Name all your pens and insist that meetings can’t begin until they’re all present. Come to work in your pajamas.
No matter what anyone asks you, reply “Okay.”
Page your co-workers to call their extensions so they call themselves.
Page yourself over the intercom. (Don't disguise your voice.)
Put a chair facing a printer, sit there all day and tell people you’re waiting for your document.
Put a picture of your mother on your business card.
Put decaf in the coffeemaker for 3 weeks. Once everyone has gotten over their caffeine addictions, switch to espresso.
Put on your headphones on whenever the boss comes into the office. Talk in a loud voice. Remove your headphones when he or she leaves.
Put shaving cream on your boss’s telephone earpiece. Dial the number. When he/she answers, say “Sqwish.”
Put those hole reinforcing circles on the center of you eyeglasses. Now go to that executive meeting.
Put up mosquito netting around your cubicle. Play a tape of jungle sounds all day.
Put your garbage can on your desk. Label it “IN.”
Schedule meetings for 4:14 pm.
Send e-mail messages saying free pizza, free donuts etc... in the lunchroom, when people complain that there was none... Just lean back, pat your stomach, and say, “Oh you’ve got to be faster than that.”
Send email to the rest of the company telling them what you're doing. For example "If anyone needs me, I'll be in the bathroom."
Send email to yourself engaging yourself in an intelligent debate about the direction of one of your company’s products. Forward the mail to a co-worker and ask her to settle the disagreement.
Send emails one word (or a few) at a time. end each one wth something like, "more to come tuned to your inbox for further developments..."
Sing “It’s a Small World After All” really loud in your cubical.
Subscribe your coworkers to those free trade journals. Give them wacky middle names. Example: Bobby “Pud” McNeel.
Suggest that beer be put in the soda machine.
Talk to your mouse as if it is a C.B. radio.
Wait until a co-worker goes on vacation, then relocate everything they have in their office, and move someone else in their place. When they get back act like nothing has changed since they left.
When an a person tells you that they'll be there shortly, reply in a scathing tone of voice: "And just how many weeks do you mean by shortly?"
When in conversation, no matter where you are in the office, mutter, “I think my phone is ringing” and leave. Go get a coffee.
When IT support sends you an e-mail with high importance, delete it at once.
Whenever anyone comes in your cubicle insist they knock or don’t speak with them. When they knock, ignore them.
While making presentations, occasionally bob your head like a parakeet.
While sitting at your desk, soak your fingers in “Palmolive”.
---------------room mate -------------------
Administer last rites as s/he sleeps.
Adopt an iguana. Collect the skin peelings. Give them to your roommate as a peace offering from Peter (the iguana).
Always flush the toilet three times.
Announce everything you do as a group activity. (i.e. "We're going to bed now.") If your roommate fails to do whatever you said, accuse him/her of not being a "team player."
Announce on the answering machine that your roommate has moved out. Tell anyone who calls for him/her not to call here anymore.
Arrange thirteen toothbrushes of different colors on your dresser. Set one aside from the rest. Laugh hysterically at the one toothbrush. When your roommate asks about it, refuse to discuss the situation.
Arrange your pillows and blankets every night to make it look like you are asleep. Do this for three weeks. Buy a cantaloupe and a knife. Stick the knife in the cantaloupe. Lay it on the pillow where your head should be.
As soon as your roommate turns the light off at night, begin singing famous operas as loud as you can. When your roommate turns on the light, look around and pretend to be confused.
Ask your roommate if Bob, your invisible friend, can stay the night. If s/he agrees, ask your roommate if s/he can turn down the music. Explain that Bob has a headache.
Ask your roommate if your family can move in "just for a couple of weeks."
Ask your roommate to pose for a portrait. Leave.
Become a mime. Nothing is more annoying than a mime.
Become a secret agent for a week. Eat every piece of paper after reading it. Speak into your lapel. Accuse your roommate of stealing the secret plans to the world's greatest battlestation. Carry a gun.
Become a Trekkie. Talk to your communicator. Tell Scottie to beam you up and run quickly from the room. If your roommate asks, tell him/her "Dammit, Jim, I'm just a doctor!"
Become your own twin brother and tell your roommate that you and your brother never appear in the same place at once. Tell your roommate the same thing again after leaving and coming back into the room.
Begin to accumulate a used gum ball. Weigh it every day. Accuse your roommate of stealing gum.
Borrow your roommate's clothes. Offer to wash them, then act like they were yours all along.
Bowl inside the room. Set up tournaments with other people in the building. Award someone a trophy. If your roommate wants to bowl too, explain that s/he needs bowling shoes.
Break the window with a rock. If your roommate protests, explain that you were hot. Open and close the broken window as you normally would.
Bring in potential "new" roommates from around campus. Give them tours of the room and the building. Have them ask about your roommate in front of him/her, and reply, "Oh, him/her? S/he won't be here much longer."
Bring several dogs to your room. Hold conversations with them whenever your roommate comes in. If s/he complains, tell him/her s/he is being prejudiced on the basis of your friends' species. Call him/her a bigot.
Build a fort out of beer cans. Refuse to come out until you are granted audience with Zontar, High Lord of Saria 3.
Build a snowman out of big balls of toilet paper. Throw water on it and begin to cry that the snowman is melting.
Build a snowperson with your roommate and place a hat on its head. When it doesn't come to life, cry hysterically, "It didn't work!"
Build an antfarm. Let your ants have "jailbreaks". Then ask your roommate to help you hunt down all the renegade ants.
Burn all your waste paper while eyeing your roommate suspiciously.
Burn candles at night. Yell at your roommate if s/he turns on any light and claim that they'll scare "your friends" away.
Burn incense.
Buy a bunch of T-shirts with flamboyant designs. Wear them inside out. Look in the mirror often and say, "This looked so much better in the store..."
Buy a copy of Frankie Yankovic's "Pennsylvania Polka," and play it at least 6 hours a day. If your roommate complains, explain that it's an assignment for your primitive cultures class.
Buy a copy of Helter Skelter or Silence of the Lambs or any equally gruesomely titled book. Sit in a room with your roommate and read the book (or pretend to) with a highlighter mumbling, "That looks good..." as you highlight passages in the book.
Buy a gerbil. Go into your room and close the door. Hide the gerbil in the closet, and then giggle and squirm uncontrollably for the rest of the day.
Buy a gun. Clean it every day. One day, put a Band-Aid on your forehead, and refuse to discuss the gun ever again.
Buy a jack-in-the-box. Every day, turn the handle until the clown pops out. Scream continuously for twenty minutes.
Buy a lamp. Tell your roommate it's a magic lamp, with a genie inside it. Spend a week thinking about what to wish for. At the end of the week, report that someone has released the genie from the lamp. Blame your roommate.
Buy a lava lamp. Stare at it for hours, imitating its movements with your face. Explain to your roommate that you have established a connection with the spirit world through the lava lamp. Tell your roommate that "Grandma said 'hi.'"
Buy a lobster. Pretend to play cards with it. Complain to your roommate that the lobster is making up his own rules.
Buy a McDonald's "Happy Meal" for lunch every day. Eat the straw and the napkin. Throw everything else away.
Buy a plant. Sleep with it at night. Talk to it. After a few weeks, start to argue with it loudly. Then yell, "I can't live in the same room with you," storm out of the room and slam the door. Get rid of the plant, but keep the pot. Refuse to discuss the plant ever again.
Buy a snake. Give it free reign of the room.
Buy a telescope. Sit on your bed and look across the room at your roommate through the telescope. When you're not using the telescope, act like your roommate is too far away for you to see.
Buy a watermelon. Draw a face on it and give it a name. Ask your roommate if the watermelon can sleep in his/her bed. If your roommate says no, drop the watermelon out the window. Make it look like a suicide. Say nasty things about your roommate at the funeral.
Buy an inflatable doll. Sleep with it.
Buy as many back issues of Field and Stream as you can. Pretend to masturbate while reading them.
Buy copies of Playgirl if you are male, or Playboy if you are female. Read the magazine very slowly. If your roommate comments, grin and say, "I bought it for the articles."
Buy forty two-liter bottles of generic soda. Dump out one bottle. Every time you drink a bottle, piss in the empty one. Do so until you have thirty-nine bottles of urine. Complain to your roommate that generic soda tastes awful.
Buy Lay's potato chips with all your money. Stack the bags in the middle of the room in a pyramid. Eat them whenever your roommate is in the room. For every one you eat, offer your roommate one, each time telling him, "No one can eat just one."
Buy Sea Monkeys and grow them. Name one after your roommate. Announce the next day that that one died. Name another one after your roommate. The next day say that it died. Keep this up until they all die.
Buy seven different colored yo-yo's. Practice with them seven hours a day, alternating yo-yo's on the hour.
Buy some knives. Sharpen them every night. While you're doing so, look at your roommate and mutter, "Soon, soon...."
Buy some turtles. Paint numbers on their backs. Race them down the hall.
Buy three loaves of stale bread. Grow mold in the closet.
Call him/her Mommy.
Call safety & security whenever your roommate turns up his/her music.
Call your roommate "Clyde" by accident. Start doing so every so often. Increase the frequency over the next few weeks, until you are calling him/her "Clyde" all the time. If your roommate protests, say, "I'm sorry. I won't do that anymore, Murray."
Carry a crowbar with you at all times. Dress it.
Carry a pair of walkie-talkies with you at all times. Insist that s/he use one when ever s/he wants to talk to you.
Carry an electric fan at all times. Speak into it.
Carve a jack-o'lantern. Complain to your roommate that the jack-o-lantern has been staring at you. The next day, tell your roommate that the jack-o-lantern thinks s/he has been staring at it. Confide in your roommate that you really don't like the jack-o'lantern, but you can't convince it to move out.
Carve a large phallus. Pray to it daily.
Carve grotesque, morbid, and/or erotic pictures into your bedframe with a butcher knife.
Chain yourself to your roommate's bed. Get him/her to bring you food.
Challenge your roommate to a duel. If s/he refuses, claim that you have won by forfeit and therefore conquered his/her side of the room. Insist that s/he remove all of his/her possessions immediately.
Change the locks on the door. Don't let your roommate in unless s/he says the secret word. Change the secret word often. If your roommate can't guess the secret word, make him/her pay a tithe.
Chase your roommate with a bloody toothbrush. Tell him/her "It only hurts for a little while."
Claim you were a Christmas tree in your former life. If s/he tries to bring one into the room, scream bloody murder and trash on the floor.
Clip your fingernails and toenails and keep them in a baggie. Leave the baggie near your computer and snack from it while studying. If s/he walks by, grab the bag close and eye him/her suspiciously.
Collect all of your pencil shavings and sprinkle them on the floor.
Collect all your urine in a small jug.
Collect Chia Pets.
Collect cow tongues. Paint them. Nail them up next to the bacon.
Collect dog poop in baby food jars. Sort them according to what you think the dog ate.
Collect hundreds of pens and pile them on one side of the room. Keep one pencil on the other side of the room. Laugh at the pencil.
Collect potato chips that you think look like famous people. Find one that looks like your roommate. Burn it, and explain, "It had to be done."
Collect potatoes. Paint faces on them and give them names. Name one after your roommate. Separate your roommate's potato from the others. Wait a few days, and then bake your roommate's potato and eat it. Explain to your roommate, "He/She just didn't belong."
Come home at three in the morning wearing shredded jeans and no shirt. Dive into the room and under your bed. Tell your roommate that you were being held captive by ten Mesopotamian foot soldiers in full battle array.
Communicate using only your eyebrows and tongue.
Complain about your menstral cramps. Loudly. This works best, of course, if you happen to be male.
Complain that your elbows, knees, and other joints have been bothering you. Get a screwdriver, and pretend to "fix" them.
Complain vehemently that pedophilia legislation is "too restrictive."
Compose an obituary for your roommate. Keep it posted in a conspicuous place and update it frequently. Report the date of death as one week before the end of the semester.
Constantly ask your roommate, "Do you feel lucky?" while fingering a bulge under your jacket.
Constantly slip and fall on your carpet.
Count down the days till the next full moon. Whenever you cross out another day, get a wild look in your eyes and mutter, "Soon...so very soon..."
Cover your bed with a tent. Live inside it for a week. If your roommate asks, explain that "It's a jungle out there." Get your roommate to bring you food and water.
Create an animal cemetery in your floor. Hold memorial services. If your roommate complains, tell him/her that s/he has no respect for the dead.
Create an army of animal crackers. Put them through basic training. Set up little checkpoints around the room. Tell your roommate that the camel spotted him/her in a restricted area and said not to do it again. Ask your roommate to apologize to the camel.
Create an imaginary cat for a pet. Talk to it every night, act like you're holding it, keep a litter box under your desk. After two weeks, say that your cat is missing. Put up signs in your dorm, blame your roommate.
Cry a lot.
Cut the faces out of all your pictures.
Dance around the room with underwear on your head while listening to old Herb Alpert and the Tijuana Brass records. If your roommate questions you, throw a pair on his/her head and TANGO!!!
Develop ESP. Answer all of your roommate's questions before s/he asks them.
Develop Multiple Personality Disorder. Use your other selves to act out Shakespearean tragedies.
Develop partial amnesia each time you go to sleep. When you wake up, claim to have forgotten anything regarding your roommate. Spend hours finding out everything about him/her, and just before you go to bed, say you think you and s/he will be great friends. When you wake up, claim to have forgotten anything regarding your roommate...
Do all your homework in the bathroom, using the toilet as a desk.
Do impressions all the time. Good ones to try: Mr. T, Gilbert Gottfried, Judy Tenuta, Roseanne Barr.
Don't ever flush.
Don't shower for three weeks. Complain often about the stench. Demand that your roommate do his/her laundry.
Draw a chalk outline on the floor. When your roommate comes in, say, "Don't worry. It's not what you think." If s/he asks about it again, immediately change the subject.
Draw a tiny, black spot on your arm. Make it bigger every day. Look at it and say, "It's spreading, it's spreading."
Dress as similarly as possible like your roommate. Walk closely next to him/her the whole day, remarking "Don't we look like twins?" to any passersby.
Dress in drag.
Dress like a military officer. Insist that your roommate salute you upon sight. If s/he refuses, insist that s/he do 100 push-ups. Keep saying things like, "Your momma isn't here to take care of you any more."
Drink a cup of coffee every morning. When you finish it, gnaw on the mug for about ten minutes. Then, look at your roommate, immediately put the mug away, and quickly leave the room.
Drink a raw egg for breakfast every morning. Explain that you are in training. Eat a dozen donuts every night.
Drink lots of lemonade. Talk obnoxiously for hours about how much you love lemonade. Then, one day, paint your face yellow. From then on, complain about how much you hate lemonade.
Dye all your underwear lime green.
Eat a bag of marshmallows before you go to bed. The next day, spray three bottles of whipped cream all over your floor. Say you got sick.
Eat glass.
Eat jewelry. Accessorize food.
Eat lots of "Lucky Charms." Pick out all the yellow moons and stockpile them in the closet. If your roommate inquires, explain that visitors are coming, but you can't say anything more, or you'll have to face the consequences.
Eat lots of alphabet soup. Throw out any of the letters that are in your roommate's name; claim you want nothing to do with them.
Eat moths.
Eat raw pasta for dinner.
Every hour on the hour, call to get the time. Reset each of your clocks to the second. Remark that your roommate has no respect for the virtue of being prompt.
Every night, before you go to bed, beg your roommate for a glass of water. When s/he brings it, dump it on the floor and immediately go to sleep. If s/he ever refuses to bring you a glass of water, lie on the bed and pretend to be dying of dehydration, making annoying gagging sounds, until s/he does so.
Every now and then start twitching violently and scream "Snakes, snakes!"
Every Thursday, pack up everything you own and tell your roommate you're going home. Come back in an hour and explain that no one was home. Unpack everything and go to sleep.
Every time the phone rings, turn on the stereo at full volume and begin to violently slam-dance with your roommate. If s/he asks about it, say, "Oh, that damn hypnotist...."
Every time you enter the room, sit in a chair, lean back too far, and fall over backwards. Laugh hysterically for about ten minutes. Then, one day, repeat the falling-over exercise, but instead of laughing, get up, look at the chair sternly, and say, "It's not funny anymore."
Every time you see your roommate yell, "You son of a..." and kick him/her in the stomach. Then buy him/her some ice cream.
Every time you take a shower, yell audibly, "I'm melting, I'm melting!"
Every time you wake up, start yelling, "Oh, my God! Where the hell am I?!" and run around the room for a few minutes. Then go back to bed. If your roommate asks, say you don't know what s/he is talking about.
Every time your roommate comes in, immediately turn off the lights and go to bed. When s/he leaves, get up and loudly yell, "Okay, guys, you can come out now."
Every time your roommate falls asleep, wait ten minutes, and then wake him/her up and say, "It's time to go to bed now."
Every time your roommate walks in yell, "Hooray! You're back!" as loud as you can and dance around the room for five minutes. Afterwards, keep looking at your watch and saying, "Shouldn't you be going somewhere?"
Explain that you need to sell your bed to make ends meet. Ask if you can sleep in your roommate's bed. If s/he refuses, ask if you can sell his/her bed instead.
Explain to your roommate that you're going to be housing a prospective student in the near future. One day, bring in a pig. If your roommate protests, hug the pig and tell your roommate that s/he hurt its feelings. Watch TV with the pig, eating lots of bacon.
Fake a heart attack. When your roommate gets the paramedics to come, pretend nothing happened.
Feign a serious illness for two weeks. Have a priest come to your room and visit you. Write out a will, leaving everything to your roommate. One day, miraculously "recover." Insist that your roommate write out a will, leaving everything to you. Every time s/he coughs, excitedly say, "Oooh, are you dying?"
Fill an empty shaving cream can with whipped cream. Use it to shave, and then spray some into your mouth. Later on, complain that you feel sick. Continue this process for several weeks.
Find out your roommate's mother's name. Tatoo it on your inner thigh, then claim, "She made me do it!"
Find out your roommate's post office box code. Open it and take his/her mail. Do this for one month. After that, send the mail to him/her by UPS.
Five minutes after you go to bed, claim that you think the Boogeyman is hiding in your closet. Make your roommate check the closet. Five minutes later, claim he is hiding under your bed. Make your roommate check. Repeat as desired.
Follow him/her around on weekends.
Follow your roommate around all day whispering, "I can reach where you can't."
Frantically scribble something on paper. When finished, eat it. Start again.
Funnel Pepsi.
Gather up a garbage bag full of leaves and throw them in a pile in his/her room. Jump in them. Comment about the beautiful foliage.
Get a Brother P-Touch labeler. Label EVERYTHING!!!
Get a can of beans. Label them, "Jumping beans." Eat them, and then jump around the room. Get another can of beans. Label them, "Dancing beans." Eat them, and then dance around the room. Get another can of beans. Label them, "Kill Your Roommate beans." Eat them, smiling at your roommate.
Get a computer. Leave it on when you are not using it. Turn it off when you are.
Get a copy of your roommate's car key. Turn his/her car around in its parking space. A few days later, move it to the next space. A few days after that, move it two spaces over. Continue until you start moving the car to a different lot.
Get a friend to leave a phone message for you with your roommate, saying the test results came back positive. When your roommate tells you, cough, faint, and then refuse to discuss it.
Get a loft. Sleep hanging upside down from it like a bat.
Get a pet rabbit. At a designated time every day, take the rabbit into the bathroom and engage in loud shouting matches. If your roommate inquires, refuse to discuss the situation.
Get a surfboard. Put it on your bed. Stand on it, and pretend to surf for about fifteen minutes. Then, pretend to "wipe out," and fall off the bed onto the floor. Pretend you are drowning until your roommate comes over to "rescue" you.
Get some hair. Disperse it around your roommate's head while s/he is asleep. Keep a pair of scissors by your bed. Snicker at your roommate every morning.
Get your roommate's social security number. Call the registrar and switch all of his/her classes. Tell your roommate at the end of the term that the Philosophical Environmental Anthropology exam is supposed to be really hard. Wish him/her luck.
Give each of your walls a different name. Whenever you can't answer a problem, ask each of your walls. Write down their responses, then ask your ceiling for the final answer. Complain to your roommate that you don't trust your ceiling.
Give him/her an allowance.
Give unsolicited sensual massages at least once daily.
Give your roommate a jar of peanuts. Wait until s/he has eaten half of them, then explain they used to be chocolate-covered, but you licked all the chocolate off of them. As an aside, mention that you are coming down with the flu.
Give your roommate a plastic bag. Ask him/her to shit in it because your pet dung beetles are hungry.
Give your roommate the gifts from the "Twelve Days of Christmas" song.
Give your roommate's clothes to the Salvation Army.
Go for joy-rides in the washing machine.
Go through his/her books hilighting all instances of the words "death" and "children." Insist that he study them.
Go through medical supply catalogs circling all electric drill and suction devices. Leave them (the catalogs, not the devices) lying around.
Go through your roommate's textbooks with a red pen, changing things and making random corrections. If your roommate protests, tell him/her that you just couldn't take it anymore.
Go to the mall with your roommate and sit on Santa's lap. Refuse to get off.
Groom yourself like a cat.
Hang a basketball net on the wall. Challenge your refrigerator to basketball games, and play them in front of your roommate. Do so for about a month. Confide in your roommate that you think the refrigerator has been taking steroids.
Hang a horseshoe above the door. Make up stories about having had good luck. Then, take the horseshoe down and wrap your head in bandages. When you see your roommate, look above the door where the horseshoe used to be, hold your head, and mutter, "Stupid horseshoe...."
Hang a picture of your roommate on the wall. Throw darts at it. Smile at your roommate often, saying things like, "How nice to see you again."
Hang a stocking with your roommate's name on it. Collect coal and sharp objects in it. If s/he asks, say "You've been very naughty this year."
Hang a tire swing from the ceiling. Act like a monkey. If someone besides your roommate comes in, cease acting like a monkey and claim that the tire swing was your roommate's idea. When you and your roommate are alone again, continue acting like a monkey.
Hang all of your posters up facing the wall.
Hang mistletoe in the doorway. When your roommate enters or leaves the room, plant a wet one on his/her lips.
Hang stuffed animals with nooses from your ceiling. Whenever you walk by them mutter, "You shouldn't have done that to me."
Hang up pictures of chickens all over the room. If your roommate eats eggs, yell at him/her and call him/her a cannibal.
Hang your roommate in effigy.
Have really weird friends who have strange loud conversations. Whenever your roommate walks in, you all be quiet and stare at him/her until s/he leaves.
Hide a bunch of potato chips and Ho-Hos in the bottom of a trash can. When you get hungry, root around in the trash. Find the food, and eat it. If your roommate empties the trash before you get hungry, demand that s/he reimburse you.
Hide all your roommate's stuff and tell him/her that s/he never lived with you. Extra points if s/he checks with the housing director.
Hide under a pile of dirty clothes in the closet. Twitch a lot and mutter, "They can't suck my brain if they can't find me!"
Hide your underwear and socks in your roommate's closet. Accuse him/her of stealing it.
Hire a night watchman to guard the room while you are sleeping.
Hit your roommate on the head with a brick. Claim that you were trying to kill a mosquito.
Hold a raffle with your roommate as the prize.
Hold a raffle, offering your roommate as first prize. If s/he protests, tell him/her that it's all for charity.
If you get in before your roommate, go to sleep in his/her bed.
If you know that s/he is in the room, come barging in out of breath. Ask if they saw a fat bald naked Tibetan man run through carrying a hundred dollar bill. Run back out swearing.
If you live on the first floor, refuse to use the door. Climb in and out through the window. Claim doctor's orders.
If your roommate comes home after midnight, hit him/her on the head with a rolling pin. Immediately go to bed, muttering, "Ungrateful little..."
If your roommate goes away for a weekend, change the locks.
If your roommate has cans of Chef Boyardee, buy dog food in similar-size cans. Switch the labels.
Inject his/her Twinkies with a mixture of Dexatrim and MSG.
Insist on writing the entire lyrics to American Pie on your ceiling above your bed. Sing them every night before you go to bed.
Insist that you are a vegetarian and protest anytime your roommate eats meat. Then leave "Slim Jim" wrappers on the floor and lie on the bed holding your stomach every time your roommate walks in. If s/he asks about the wrappers, say you know nothing about them.
Insist that your roommate recite the "Pledge Of Allegiance" with you every morning.
Instead of turning off the light switch, smash the light bulb with a hammer. Put a new bulb in the next day. Complain often about the cost of light bulbs.
Invite a homeless person to live in your room and sleep in your roommate's bed.
Invite the Dean to sleep over.
Invite the school President to sleep over.
Invite your invisible friends over for a few weeks. Blame them when all his/her beer is gone. Be convincing.
Invite your roommate to play catch out in the yard. Every time you catch the ball, catch it near your head. Fall to the ground screaming.
Invite your roommate to sleep over.
Invite your roommate's parents to a "surprise" party for your roommate. When they get there, stone them.
Keep a collection of teeth in a jar. Act excited whenever you add to it, and say things like, "In a little while I'll have enough for that sailboat."
Keep a hamster as a pet. Buy a blender, and make milkshakes every day. Then, one day, get rid of the hamster. Make a shake using a lot of ketchup. When your roommate comes in, look at the shake, look at the empty cage, and tell your roommate, "I was curious."
Keep a harem of thirty Cabbage Patch Kids. Ask if your roommate "has any desires."
Keep a tarantula in a jar for three days. Then get rid of the tarantula. If your roommate asks, say, "Oh, she's around here somewhere."
Keep a vacuum cleaner in the middle of the room. Look at it with fear for a few days. Then stay out of the room entirely, opening the door only a crack and whispering to your roommate, "Psst! Is it gone?"
Keep empty jars on the shelf. Tell your roommate that this is your collection of "inert gases." Look at them often. One day, act surprised and angered, and accuse your roommate of having released one of the gases. Cover your nose and mouth and run out of the room.
Keep feces in your fridge. Complain that there is never anything to eat.
Keep some worms in a shoebox. When doing homework, go and consult with the worms every so often. Then become angry, shouting at the worms that they're stupid and they don't know what they're talking about.
Kill roaches with a monkey wrench while playing Wagnerian Arias on a kazoo. If your roommate complains, explain that it is for your performance art class (or hit him/her with the wrench).
Late at night, start conversations that begin with, "Remember the good old days, when we used to..." and make up stories involving you and your roommate.
Laugh a lot in the morning. Tell your roommate to be happy all the time.
Lay in the middle of the room and chant to pagan gods.
Learn a lot of quotations. Whenever you talk to your roommate, say nothing but quotes for three weeks.
Learn Morse code. Adopt it as your sole method of communication.
Learn the words to all your roommate's favorite songs. Sing along.
Learn to levitate. While your roommate is looking away, float up out of your seat. When s/he turns to look, fall back down and grin.
Learn to play an accordion.
Leave a declaration of war on your roommate's desk. Include a list of grievances.
Leave apple cores on his/her bed.
Leave Kleenexes dipped in mayonnaise on the floor. Tell guests that your roommate is disgusting and show them.
Leave little notes in the shower for him/her.
Leave lots of pills in your drawer, and walk around like a zombie.
Leave memos on your roommate's bed that say things like, "I know what you did," and "Don't think you can fool me." Sign them in blood.
Leave morbid outgoing messages on your answering machine. Be creative.
Leave the room at random, knock on the door, and wait for your roommate to let you back in. If s/he asks about it, go on a tangent about the importance of good manners.
Leave urgent telephone messages for him/her when no one has called.
Leave your room and lock the door. Proceed to bang on the door, screaming, "Let me in." Get mad at your roommate for locking you out.
Let mice loose in his/her room.
Let your alarm clock go off and refuse to turn it off. If your roommate comments, pretend not to hear anything.
Lick him/her while they are asleep.
Lick his/her feet as he sleeps. If s/he wakes up, apologize. After s/he falls asleep, start licking his/her face.
Lie spread-eagled on your roommate's bed. Make him/her move you.
Light your hair on fire. Refuse to put it out.
Listen to Morrisey. Be happy before, during, and after you listen.
Listen to nothing but obscure Broadway musicals. Learn all the words and sing along. Be sure to do all the different voices.
Listen to radio static.
Live in the hallway for a month. Afterwards, bring all of your stuff back into the room and tell your roommate, "Okay, your turn."
Lock the door while your roommate is out. When s/he comes back and tries to unlock it, yell, "Don't come in, I'm naked!" Keep this up for several hours. When you finally let your roommate in, immediately take off all of your clothes, and ignore your roommate.
Lock your door every time you go through it. Tell him/her that you're afraid of aliens.
Make a care package for your roommate. Leave the room and ride back and forth outside your window saying, "Speedy Delivery!" until s/he comes out.
Make a contract with the Mafia to kill your roommate. Become a born-again Christian and dreadfully regret your actions. Explain to your roommate the situation, how sorry you are, and that there is nothing you can do to prevent the hit. Try to convert your roommate before s/he dies.
Make a sandwich. Don't eat it, leave it on the floor. Ignore the sandwich. Wait until your roommate gets rid of it, and then say, "Hey, where the hell is my sandwich!?" Complain loudly that you are hungry.
Make a voodoo doll of your roommate. Kill it.
Make anatomically correct gingerbread people and eat the best parts first.
Make brown-bag lunches for your roommate every morning. Give them to him/her before s/he goes to class.
Make conversation out of Christmas Carols. (i.e. "You know, I saw mommy kissing Santa Claus underneath the mistletoe last night.")
Make cue cards for your roommate. Get them out whenever you'd like to have a conversation.
Make pancakes every morning, but don't eat them. Draw faces on them, and toss them in the closet. Watch them for several hours each day. Complain to your roommate that your "pancake farm" isn't evolving into a self-sufficient community. Confide in your roommate that you think the king of the pancakes has been taking bribes.
Make some rice for dinner. Pause suddenly, spit out a mouthful and scream "Maggots! Maggots!" Blame your roommate. When done, make more rice and finish eating.
Make toast for breakfast every morning, but don't plug the toaster in. Eat the plain bread, looking at the toaster angrily, and complain that the toaster doesn't know what it's doing. If your roommate suggests plugging it in, go on a tangent about fire-safety hazards.
Make your bed 15 times a day. Sleep on the floor.
Make your finger talk to you. Write backwards on the walls.
Mount a wall-sized mirror on your wall and then ask your roommate not to look at it because demonic forces from the other side will escape into this world if s/he does.
Move all of his furniture outside. Tell him/her that it was such a nice day out, you wanted to be sure s/he enjoyed it.
Move all of your possessions to your roommate's side of the room, and all of his/her possessions to your side. Move everything back the next day. Do this each day for a week.
Move everything to one side of the room. Ask your roommate if s/he knows how much an elephant weighs, and look at the floor on the empty side of the room with concern.
Move very stiffly and grin. Tell your roommate that you've turned into Gumby.
Move your bed around the room once a day, and leave it in a new position every night.
Move your roommate's personal effects around. Start subtly. Gradually work up to big things, and eventually glue everything s/he owns to the ceiling.
Nail boards across your window. When your roommate asks why, tell him/her you know they're all watching you.
Nail meat to the walls. Bacon is best.
Name your books. Call them like dogs when it's time to study.
Never allow your roommate's head to be below yours.
Never speak to your roommate directly. If you need to ask or tell him/her something, go to another room and call him/her on the phone.
Open a can of his/her beans or spaghetti, empty it into his/her bed and then replace the can in the cupboard.
Open the window. After 30 minutes, complain about the cold and open it wider.
Open your window shades before you go to sleep each night. Close them as soon as you wake up.
Order five anchovy pizzas in your roommate's name. When the deliverer arrives, tell them that your roommate likes to play jokes on the pizza place and then your roommate lies about his/her ordering. Tell them where s/he is.
Organize a black mass. Tell your roommate that the sacrifice backed out at the last minute and if s/he would volunteer.
Pack up all of your things and tell your roommate that you're going away to "find yourself." Leave, and come back in about ten minutes. If your roommate asks, explain that you're not a hard man/woman to find.
Pack your roommate's clothing in ice overnight. Put it back in the dresser before s/he wakes up.
Paint a mural depicting Napoleon's defeat at Waterloo on your roommate's mattress. Hand it in to your art teacher for a grade.
Paint a tunnel on the wall like they do in cartoons. Every day, hit your head as you attempt to crawl through it. Hold your head and grumble, "Damn road runner...."
Paint abstract paintings, and title them things like, "Roommate Dying in a Car Crash," and "Roommate Getting Whacked in the Head with a Shovel." Comment often about how much you love the paintings.
Paint targets on the back of all his/her shirts. Buy a crossbow.
Paint your half of the room black. Or paisley.
Paint your nose red and wear antlers. Constantly complain about how you never get to join in on the reindeer games.
Paste boogers on the windows in occult patterns.
Paste used Kleenexes to his/her walls.
Pick up the phone every two minutes. Then slam it down and say, "Damn, missed them again!" Continue for two weeks.
Pile dirty dishes in your roommate's bed. Insist that you don't know how they got there.
Pin a pointsettia to your lapel.
Place porn mags, both soft- and hard-core, around the room. Buy ten or twenty jars of Vaseline. Stack them in a pile in a corner on the floor. Whenever your roommate is expecting company, smear your hands with Vaseline. When greeting them, shake hands vigorously for a minute.
Plant grass in the carpet and scream at your roommate every time s/he takes a step in the room. Put up a "please don't walk on the grass" sign.
Play Dungeons & Dragons all the time. Tell your roommate to obey you because you are the Dungeon Master. Attack invisible dragons with a cardboard sword.
Play hide and seek with yourself. If your roommate asks what you're doing behind the couch, under the table, etc., look at them exasperatedly, come out of hiding and tell him/her that s/he gave away your hiding place. Refuse to talk to him/her for several hours.
Play violent games with imaginary friends.
Plug your telephone handset into your modem's in jack. Make the modem noises into the handset. ("Wheeeheeeeooooaiyeee...") Complain about how your stupid computer never works.
Post a sign in your bathroom that reads: "If it's yellow let it mellow, if it's brown flush it down." Check every time to make sure s/he follows it.
Practice needlepoint every night. At one point, grab your thumb and scream, "Owwwwwww!" Cry hysterically for a few minutes, and then go to bed. Sob and sniff all night.
Pray to Azazoth or Zoroaster. Sacrifice something nasty.
Pretend to administer electro-schock therapy as s/he studies.
Pretend to shower often but only wash your hair in the sink. See how long it takes your roommate to notice.
Pretend you are Jan Brady. (Marsha Marsha Marsha!)
Pretend your arms and legs have been amputated. Insist that you "cannot wipe."
Print up satanic signs and leave them in your room where s/he can find them.
Punch a hole in the TV. Sit and watch it anyway, complaining about the poor picture quality.
Put a chamber pot in your closet. Fill it with lemon-lime Gatorade. Pretend to use it. Drink from it and offer your roommate a cup.
Put bricks in the middle of the room, and explain to him/her that you intend to make a fireplace to save electricity.
Put headphones on your roommate while s/he is sleeping, and subliminally teach him/her to speak Spanish, play the trombone, and memorize all the major imports and exports of each African nation.
Put horseradish in your shoes.
Put in your contacts when you go to bed. Scream in agony as you rip them from your bloody eyelids in the morning. Put them in again that night. Complain to your roommate that you just can't see a darned thing anymore.
Put no-doze pills in your roommate's drinks.
Put on a fake white beard and insist that all your roommate's friends "give it a yank."
Put out a plate of cookies at night. Tell your roommate that they're for the Sandman. Take a bite out of one of the cookies while your roommate is asleep. The next morning, accuse your roommate of having bitten one of the cookies. If s/he tries to tell you the Sandman did it, insist that you know what the Sandman's teeth marks look like and that those are, in fact, not the Sandman's teeth marks. Grumble angrily and storm out of the room.
Put peas in the toilet everytime you go to the bathroom.
Put pornos under his/her bed. Whenever someone comes to visit your roommate when they're not home, show them the magazines.
Put tapes/CDs in the stereo and listen to them with the volume off. Replace them regularly. Tell your roommate to be quiet so you can hear.
Put up flyers around the building, reporting that your roommate is missing. Offer a reward for his/her safe return.
Put up traffic signs around the room. If your roommate doesn't obey them, give him/her tickets. Confiscate something your roommate owns until s/he pays the tickets.
Put Vaseline on everything. Tell your roommate that you were just trying to "loosen up" the room.
Put your glasses on before you go to bed. Take them off as soon as you wake up. If your roommate asks, explain that they are Magic Dream Glasses. Complain that you've been having terrible nightmares.
Put your mattress underneath your bed. Sleep down under there and pile your dirty clothes on the empty bedframe. If your roommate comments, mutter "Gotta save space," twenty times while twitching violently.
Quote Bob Barker at length.
Read lots of science fiction and begin to act as though you think your roommate is an alien in disguise. Jump on him/her and try to rip off the humanoid mask the alien is wearing.
Read the phone book out loud and excitedly. ("Frank Johnson! Oh, wow! 837-9494! Holy cow!")
Read with a flashlight when the lights are on. Pretend to read without one when the lights are out, remarking every so often how great the book is.
Read your textbooks aloud. Ask your roommate for help on big words.
Recite Dr. Seuss books all the time. Eventually, think up melodies for the words and sing them loudly and directly to your roommate. If s/he tells you to stop, act offended and spend the day in bed.
Recite entire movie scripts (e.g. "The Road Warrior," "Repo Man," "Casablanca") almost inaudibly.
Redivide the room horizontally. Claim you want the bottom half.
Refer to yourself in the royal third person.
Refuse to communicate in anything but sign language.
Refuse to wash your underwear. Say that you are trying to prove LaMarck's theory of spontaneous generation.
Remove the shelves from the refrigerator. Sit inside, moaning periodically.
Remove your door. Ship it to your roommate's parents (postage due).
Repeat everything your roommate says, but without the consonants.
Replace his/her toothpaste with Fix-O-Dent.
Replace the fuses in his electrical equipment with a lower rating.
Ring jingle bells maniacally saying, "Every time a bell rings an angel gets his wings."
Rollerskate up and down the hallway. Every time you see your roommate, crash into him/her and knock him/her down. Apologize, and say that s/he looked like "the enemy."
Sacrifice vegetables in the middle of the room.
Save all of your nail clippings. Make sculptures out of them.
Save the wrappers to everything that you eat. Collect them in a ball and store it on your roommate's bed.
Save your used tissues. Have snowball fights.
Say everything in Pig Latin.
Scatter stuffed animals around the room. Put party hats on them. Play loud music. When your roommate walks in, turn off the music, take off the party hats, put away the stuffed animals, and say, "Well, it was fun while it lasted."
Scratch your head a lot. Pretend to eat the lice you find. Offer one to your roommate.
Scratch yourself and others. Stop when you draw blood.
Send flowers to your roommate, with a card that says, "I'm sorry. It won't happen again." When you see them, start ripping up the flowers. Repeat the process for a few weeks.
Send secret admirer notes on your roommate's e-mail.
Set off the smoke alarm in your room and tell the fire department your roommate was smoking.
Set up about twenty plants in an organized formation. When your roommate walks in, pretend to be in the middle of delivering a speech to the plants. Whisper to them, "We'll continue this later," while eyeing your roommate suspiciously.
Set up meetings with your roommate's faculty advisor. Inquire about his/her academic potential. Take lots of notes, and then give your roommate a full report. Insist that s/he do the same.
Set your alarm clock for three o'clock. Push the doze button every 5 minutes when it beeps for the next five hours, each time telling your roommate that you'll wake up in five minutes.
Set your roommate's bed on fire. Apologize and explain that you've been watching too much "Beavis & Butthead." Do it again. Tell him/her that you're not sorry because this time, they deserved it.
Shadow box several times a day. One day, walk in looking depressed. If your roommate asks what's wrong, explain that your shadow can't box with you anymore due to an injury. Ask your roommate if you can box with his/her shadow.
Shave off one of your eyebrows. Buy a doll or plush animal and shave one of its eyebrows as well. Whenever you enter the room, give a secret salute and handshake to the toy. Sit with it for hours and talk loudly about the folly of the two-eyebrowed ones.
Shave off one of your eyebrows. Look at your profile in the mirror for hours each day; first one side, then the other. Every three minutes, remark to your roommate, "Something looks different..." When s/he comments on your eyebrow, look surprised and ask when your one eyebrow appeared.
Shave off one of your roommate's eyebrows. Comment repeatedly on how it makes him/her look younger.
Shelve all your books with the spines facing the wall. Complain loudly that you can never find the book that you want.
Shoot rubber bands at your roommate while his/her back is turned, and then look away quickly.
Sign up your roommate for all the radical organizations on campus. If they call, tell them s/he is very interested in and in favor of their cause.
Sign your roommate up for various activities. (Campus tour guide, blood donor, organ donor).
Sing: "All I want for Christmas is my roommate's two front teeth..."
Sit and stare at your roommate for hours. Bring others in to join you. Eat peanuts, throwing a few at your roommate. Then say, "Boy, these zoos just aren't what they used to be."
Sit in a corner in the fetal position rocking back and forth chanting, "Santa Claus is coming to town, Santa Claus is coming to town..."
Sit in front of a chess board for hours, saying nothing, doing nothing. Then, look up and say, "I think this game goes a lot faster with two players."
Sit in the room all weekend rubbing a baseball bat. When your roommate enters the room, close your eyes and rub as fast as you can.
Sit on the floor and talk to the wall.
Skip to the bathroom.
Sleep face down under your mattress on a bunkbed and stare at your roommate all night through the springs.
Sleep with a banana (or lemon) and refuse to throw it out even after it rots.
Smash your roommate's favorite cassettes and wrap the tape around your naked body, running around the apartment screaming "Fly, be free! Fly, be free!"
Smile. All the time.
Smoke ballpoint pens.
Smoke mistletoe. Do whatever comes naturally.
Speak at length about your lust for Pippi Longstocking as your roommate tries to fall asleep.
Speak in tongues.
Spell out the last word of each sentence you say to your roommate.
Spend all of your money on Alvin and the Chipmunks records. Play them constantly. Say that it's an assignment for your "Popular Music in the Youth Subculture" class.
Spend all your money on Jolt Cola. Drink it all. Stack the cans in the middle of your room. Number them.
Spend all your money on Transformers. Play with them at night. If your roommate says anything, tell him/her with a straight face, "They're more than meets the eye."
Spend hours in your room on personal hygiene. Spend at least an hour a day clipping your nails, another hour combing your hair, yet another hour washing your face and hands, etc.
Spill a lot of beer on his/her bed. Swim.
Spread toothpicks all over the floor. Stare at them, acting like you're trying to read something. Tell your roommate it's a message from God, but you're not sure whether it's a warning about a loved one in danger or a recipe for really great chili.
Stand behind him/her while he brushes his teeth. When s/he takes the brush out of his/her mouth, force it back in.
Stand in front of the mirror reciting "How the Grinch Stole Christmas" over and over in your
Stare at your roommate for five minutes out of every hour. Don't say anything, just stare.
Start a brothel.
Start a new-wave cult. Hold nightly candle-lit rituals in your room with your followers.
Start a scab collection. Keep it in a locked glass case on your desk. Tell your roommate that you know s/he was looking for the key.
Start dressing like an Indian. If your roommate inquires, claim that you are getting in touch with your Native-American roots. If your roommate accuses you of not having any Native-American roots, claim that s/he has offended your people and put a curse on your roommate.
Start wearing a crown, all the time. If your roommate tells you to take it off, say, "Who the hell do you think you are? A king?"
Steal a fishtank. Fill it with beer and dump sardines in it. Talk to them.
Steal a life-size nativity scene and display it in your room. When your roommate asks, tell him/her "I had to let them stay here, there's no room at the inn."
Steal a tire from a fraternity lawn. Bring it to your room. Bathe it. Name it. Sleep in it.
Steal all of your roommate's pens. Make a tower out of them. Bite him/her if s/he tries to get them back.
Steal something valuable of your roommate's. If s/he asks about it, tell him/her that you traded it for some magic beans. Give some beans to your roommate.
Stick your head out the window, but forget to open it, so that your head crashes through the glass. Then say, "Silly me," open the window again, and try to stick your head through. Act like you hit your head on something.
Study computer science and listen to techno while talking about robots taking over the world.
Subscribe to as many mailing lists and reply to as much junk mail as possible under your roommate's name. Complain that you never get mail.
Subsist entirely on pickles for a week. Vomit often.
Take a thirty-minute shower. Turn the water off. Go to the toilet for five minutes. Get back in the shower and take another thirty-minute shower. If your roommate comments, shake your head and mutter, "Damn diarrhea."
Take all of your roommate's furniture and build a fort. Guard the fort for an entire weekend.
Take his/her underwear. Wear it.
Take up cooking. Cook exotic foods from scratch without using any cookbooks or recipes.
Take up playing a musical instrument. Practice constantly in the room, but don't play anything coherent. Play "Hot Cross Buns" or similar three-note songs twenty times until you get it perfect.
Take your roommate's papers and hand them in as your own.
Talk about your roommate to the little man who lives in your pocket.
Talk back to your "Rice Krispies." All of a sudden, act offended, throw the bowl on the floor and kick it. Refuse to clean it up, explaining, "No, I want to watch them suffer."
Talk like a pirate, all the time. Refer to your roommate as "matey." Threaten to make him/her walk the plank if s/he doesn't swab the deck.
Talk on the phone a lot. Don't pick up the receiver.
Talk on the phone in gibberish. Use a high-pitched, squeaky tone.
Talk to your roommate but don't let any sound come out. Get mad at him/her for not listening to you.
Talk while pretending to be asleep.
Tattoo your roommate's name on your butt. Insist that s/he do the same for you.
Tear down all your roommate's Christmas decorations yelling "Bah Humbug!"
Tell him/her that you're committing suicide, and let him/her find some dynamite under your bed.
Tell your roommate on a daily basis that s/he is projecting negative karma.
Tell your roommate that someone called and said that it was really important but you can't remember who it was.
Tell your roommate that your toe hurts, and that means there's going to be an earthquake soon. While your roommate is out, trash everything on his/her side of the room. When s/he returns, explain that the earthquake hit, but only on one side of the room.
Tell your roommate you're moving out. Santa's buying you a house on 34th Street.
Tell your roommate, "I've got an important message for you." Then pretend to faint. When you recover, say you can't remember what the message was. Later on, say, "Oh, yeah, I remember!" Pretend to faint again. Keep this up for several weeks.
Throw blood on your roommate when s/he is wearing a coat and shout, "Animal killer!"
Throw darts at a bare wall. All of a sudden, act excited, telling your roommate that you hit the bull's eye.
Throw out your bed. Move in with your roommate.
Tie bedsheets together into a rope. Use it to get out of the dorm every morning.
Trash the room when your roommate's not around. Then leave and wait for your roommate to come back. When s/he does, walk in and act surprised. Say, "Uh-oh, it looks like THEY were here again."
Try to convince your roommate that you are indeed Louis XVI of France. Every time he grabs a knife or cuts something scream in terror and go running out of the apartment clutching your neck.
Try to eat your own ear.
Two words: Nudist colony.
Two words: pet liverwurst.
Unplug everything in the room except for one toaster. Pray to the toaster. Bring it gifts. Throw some of your roommate's possessions out the window. Say that the toaster made you do it.
Urinate in a jar and leave it by your bed. When your roommate isn't looking, replace it with a jar of apple juice. Each night before you go to bed, take a big swig from the jar.
Use a bible as Kleenex.
Videotape yourself hammering a nail into a wall for a while, and then stopping. Play the tape in your room. Right before the hammering stops on the videotape, look at the screen and say, "Don't do that."
Wake up every morning screaming "Ghost of Christmas Future, please have mercy on my soul!"
Walk and talk backwards.
Walk around with a hot dog sticking out of your fly. Act like it isn't there.
Walk backwards all the time. Then pretend to trip and hurt yourself. Fake an injury and go through a long, painful recovery. Start walking backwards again.
Walk into walls.
Walk, talk, and dress like a cowboy at all times. If your roommate inquires, tell him/her, "Don't worry, little buckaroo. You'll be safe with me."
Watch "Psycho" every day for a month. Then act excited every time your roommate goes to take a shower.
Watch TV at least 15 hours a day. Before doing so, turn the set around so it faces the wall. Watch the back of it.
Watch TV continually. Change channels so that you only see the commercials. Memorize the commercials verbatim and chant them after lights out.
Watch your roommate when s/he is sleeping. When s/he wakes up sing, "He sees you when you're sleeping..."
Wear a cape. Stand in front of an open window for about an hour every day. Then, one day, when your roommate is gone, go outside and lie down underneath the window, pretending to be hurt, and wait for your roommate to return. The next day, start standing in front of the window again.
Wear a hard hat at all times. Remove it when your roommate enters the room and dive under the bed.
Wear a paper hat. Every time your roommate walks in, say, "Welcome to McDonald's, can I take your... Oh, it's just you." Take off the hat, sit, and pout.
Wear a Santa suit all the time. Deny you're wearing it.
Wear a silly hat.
Wear all of your clothes backwards.
Wear ammonia as a cologne.
Wear decoder rings. Insist that s/he kiss them.
Wear glasses, and complain that you can never see anything. Bump into walls and doors. Put your clothes on backwards. Say, "Who's that?" every time your roommate enters the room. When you're not wearing the glasses, act like you can see fine.
Wear khakis and riding boots around the room. Goosestep often.
Wear no clothes in the room except a cowboy hat.
Wear nothing but tightie-whities whenever your roommate has guests.
Wear scary Halloween masks. Look in the mirror and scream hysterically for about five minutes every time you put one on.
Wear sunglasses at night. Bump into things often. Swear loudly.
Wear Underoos.
Wear your clothing backwards and walk around the room backwards.
Wear your shoes on the wrong feet, all the time. Constantly complain that your feet hurt.
When talking to him/her, alternate between being exceedingly polite and disgustingly rude every sentence.
When you leave the room, put on a screensaver that says, "I'm watching you."
When you walk into the room, look at your roommate in disgust and yell, "Oh, you're here!" Walk away yelling and cursing.
When you walk into your room, turn off your lights. Turn them on when you leave.
When you write, use the wrong end of the pen. Ask him/her why it doesn't work. When s/he explains it to you, nod thoughtfully and say, "OK, I've got it." Turn the paper over, and try again.
When your roommate comes in, pretend that you are on the phone, screaming angrily and shouting obscenities. After you hang up, say, "That was your mom. She said she'd call back."
When your roommate enters the room, chain yourself to the bed and make beckoning gestures. Look demure.
When your roommate goes to the bathroom, rearrange his/her posessions. Tell him/her that Santa's elves must have done it.
When your roommate has been awake for several minutes, run up to him/her screaming "Rashes! Rashes!" as loud as you can. Repeat during classes.
When your roommate has friends over, get under your covers and stare at them through a little hole in the covers. Use a telescope.
When your roommate is about to come home, hide in the closet. Five minutes after s/he gets home, walk out. If s/he comments, act as if you don't know what s/he's talking about.
When your roommate is out of the room, move his/her possessions over to your side of the room. When s/he returns, throw the things back over to your roommate's side, angrily telling him/her, "Stop invading my space."
When your roommate is typing, type on your keyboard in synchronization.
When your roommate leaves the room, raid his/her sock drawer. Switch one of each pair of your roommate's socks with one of your own.
Whenever his/her parents call and ask for your roommate, breathe into the phone for 5 seconds then hang up.
Whenever s/he goes to shower, drop whatever you're doing, grab a towel, and go shower too.
Whenever s/he has friends over, complain loudly about his/her hygiene. Be graphic.
Whenever s/he is about to fall asleep, ask questions that start with "Didja ever wonder why...." Be creative.
Whenever someone knocks, answer the phone.
Whenever the phone rings, get up and answer the door.
Whenever you go to sleep, start jumping on your bed. Do so for a while, then jump really high and act like you hit your head on the ceiling. Crumple onto your bed and fake like you were knocked out. Use this method to fall asleep every night for a month.
Whenever your boyfriend/girlfriend sleeps over, leave wearing his/her clothes.
Whenever your roommate brushes his/her teeth, watch him/her do so. Take notes. Write a paper on it, and circulate it around campus. If your roommate protests, say, "The people have a right to know!"
Whenever your roommate comes in from the shower, lower your eyes and giggle to yourself.
Whenever your roommate gets clothes back from the laundry, hide them. Then wear some every day until you have removed all the stolen clothes from hiding and they are all now dirty. Ask your roommate to wash them again.
Whenever your roommate goes to sleep, wake up.
Whenever your roommate has company, walk over into the middle of the room and sit down cross-legged without saying a word. Be oblivious to their presence. Pull a long piece of string out of your pocket, leaving one end still in your pocket. Take the other end and place it in your mouth. Make loud chewing noises as you chew on the string. If anybody says anything give them a questioning look, grunt, and continue to chew while staring, unfocused, straight ahead.
Whenever your roommate is walking through the room, bump into him/her.
Whenever your roommate sneezes, go and hide in the closet for about an hour. Look around nervously for the rest of the day.
Whenever your roommate wakes up, go to sleep.
Whenever your roommate walks in, wait one minute and then stand up. Announce that you are going to take a shower. Do so. Keep this up for three weeks.
Whenever you're on the phone and s/he walks in, hang up immediately without saying anything and crawl under your desk. Sit there for two minutes, then call whoever it was back.
Whenever you're talking to your roommate, add extra words to your sentences ("Hey Dan, did you turn in your Calculus -lick- homework?"). When talking to other people around your roommate, add his/her name to your conversation ("Can you give me the -Dan- notes for Friday's physics class?"). If your roommate comments, act as if you don't know what s/he's talking about.
While you are ironing, pretend to burn yourself. Start a garbage can fire in the middle of the room. Toss the iron inside. If your roommate objects, explain that you are just trying to get even.
While your roommate is out, glue your shoes to the ceiling. When your roommate walks in, sit on the floor, hold your head, and moan.
While your roommate sleeps, insert straws into his/her nose. If s/he removes them, administer CPR.
Whip your roommate screaming "Now Dasher, now Dancer, now Donner, and Blitzen..."
Wipe deodorant all over your roommate's walls.
Worship the Professor and Mary Ann.
Wrap yourself in Christmas lights and roll around in the snow.
Write letters to yourself from famous people. Mail them to yourself.
Write on your arms and legs with coarse sandpaper.

-----------------------------------pizza guy----------------------------
Act like you know the order taker from somewhere. Say, "BedWetter’s Camp, right?"
Add extra letters to words, ex: pizza becomes pizzzzzzzaaaaaaa
After ordering, say, "I wonder what THIS button on the phone does." Simulate a cutoff.
Amuse the order taker with little-known facts about country music.
Answer their questions with questions.
Ask about pizza maintenance and repair.
Ask for a deal available somewhere else. (e.g., If phoning Domino's, ask for a Cheeser! Cheeser!)
Ask for chips/fries with everything!
Ask for extra homo-sapien
Ask for the guy who took your order last time.
Ask how many dolphins were killed to make that pizza.
Ask if the pizza has had its shots.
Ask if the pizza is organically grown.
Ask if them if they get a free date with one of the staff if you make order over $30.
Ask if they have any idea what is at stake with this pizza.
Ask if they would like to sample your pizza. Suggest an even trade.
Ask if they're familiar with the term "spanking a pizza." Make up a description to go with the term. Ask that this be done to your pizza.
Ask if you get to keep the pizza box. When they say yes, heave a sigh of relief.
Ask if you they can put food color in the cheese.
Ask the man/woman if they can sculpt the pizza into your favorite celebrity.
Ask them to not put a band-aid on it this time or you will sue.
Ask to see a menu.
Ask what the order taker is wearing.
Ask what their phone number is. Hang up, call them, and ask again.
Ask what topping goes best with well-aged Chardonnay.
backwards pizza your order
Be vague in your order.
Belch directly into the mouthpiece; then tell your dog it should be ashamed.
Call to complain about service. Later, call to say you were drunk and didn't mean it.
Change your accent every three seconds.
Crack your knuckles into the receiver.
Dance all around the word "pizza." Avoid saying it at all costs. If (s)he says it, say, "Please don't mention that word."
Detect the order taker's psychic aura. Use it to your advantage.
Do not name the toppings you want. Rather, spell them out.
Doze off in the middle of the order, catch yourself, and say, "Where was I? Who are you?"
Eliminate verbs from your speech.
Engage in some serious swapping.
Get taker's name. Later, call exactly on the hour to say, "This is your time of day wake-up call, So-and-so." Hang up.
Give them your address, exclaim, "Oh, just surprise me!" and hang up
Haggle.
Have a movie with a good car chase scene playing loudly in the background. Yell "OW!" when a bullet is fired.
Have your pizza "shaken, not stirred."
If (s)he suggests a side order, ask why (s)he is punishing you.
If any of the above practices are rejected by the order taker, say, in your best pouty voice, "Last guy let me do it."
If he/she suggests anything, adamantly declare, "I shall not be swayed by your sweet words."
If they repeat the order to make sure they have it right, say, "Okay, that'll be $10.99; please pull up to the first window."
If using a touch-tone press 9-1-1 every 5 seconds throughout the order.
If using a touch-tone, press random numbers while ordering. Ask the person taking the order to stop doing that.
If you live next door or on the same block as the pizza place, ask them to deliver with their pizza truck.
Imitate the order taker's voice.
In your breathiest voice, tell them to cut the crap about nutrition and ask if they have something outlandishly sinful.
Keep telling the order taker about the other pizza place you sued last year.
Laugh every minute or two, mention the cat in the microwave!
Learn the topping codes or abbreviations and use them instead of the name (e.g. pp instead of double pepperoni).
Learn to play a blues riff on the harmonica. Stop talking at regular intervals to play it
Learn to properly pronounce the ingredients of a Twinkie. Ask that these be included in the pizza.
Make a list of exotic cuisines. Order them as toppings.
Make the first topping you order mushrooms. Make the last thing you say, "No mushrooms, please." Hang up before they have a chance to respond.
Make up a charge-card name. Ask if they accept it.
Move the mouthpiece farther and farther from your lips as you speak. When the call ends, jerk the mouthpiece back into place and scream GOODBYE at the top of your lungs.
Mumble, "There's a bomb under your seat." When asked to repeat that, say, "I said, 'sauce smothered with meat'."
Offer to pay for the pizza with a public flogging.
Order 52 pepperoni slices prepared in a fractal pattern as follows from an equation you are about to dictate. Ask if they need paper.
Order a Big Mac Extra Value Meal.
Order a one-inch pizza.
Order a slice, not a whole pizza.
Order a steamed pizza.
Order one with ants.
Order term life insurance.
Order the most expensive pizza and have it sent to your boss!
Order two toppings, then say, "No, they'll start fighting."
Order using lines from different movies (Luke, I am your "customer"-Darth Vader)
Order while using an electric knife sharpener.
Order with a Speak-n-Spell where applicable.
Order your pizza, singing in falseto!
Pass the phone around to everyone in the house -- have each person change the order a little.
Perfect a celebrity's voice. Stress that you won't take any crap from some two-bit can't-hack-it pimple-faced gofer.
Play a sitar in the background.
Pretend that you were trying to call 911 when they tell you you have the wrong # say oh well start to order... In the middle of your order stop and start to panic and yell “IT’S ABOUT TO BLOW” and hang up.
Pretend your flying a jet fighter in the Gulf War while ordering.
Psychoanalyze the order taker.
Put an extra edge in your voice when you say "crazy bread."
Put the accent on the last syllable of "pepperoni." Use the long "i" sound.
Put them on hold.
Quote Carl Sandberg.
Rattle off your order with a determined air. If they ask if you would like drinks with that, panic and become disoriented.
Rent a pizza.
Repeat every third third word twice
Report a petty theft to the order taker.
Say hello, act stunned for five seconds, then behave as if they called you.
Say it's your anniversary and you'd appreciate if the deliverer hid behind some furniture waiting for your spouse to arrive so you can surprise him/her.
Say you'll be able to pay for this when the movie people call back.
Say your order as fast as humanly possible.
Say, "Are you sure this is Pizza Place? When they say yes, say, "Well, so is this! You've got some explaining to do!" When they finally offer proof that it is, in fact, Pizza Place, start to cry and ask, "Do you know what it's like to be lied to?"
Say, "Kssssssssssssssht" rather loudly into the phone. Ask if they felt that.
Shout, "I'm through with (wo)men! Send me a dozen of your best, Gaston!"
Sing the order to the tune of your favorite song from Metallica's Master of Puppets CD.
Spill out your life story and ask them to they understand, if they say yes, Scream "liars, I don't believe you!" and hang up!
Start the conversation by reciting today's date and saying, "This may be my last entry."
Start the conversation with "My Call to Pizza Place, Take 1, and. . . action!"
Start your order with "I'd like. . .". A little later, slap yourself and say, "No, I don't."
State your order and say that's as far as this relationship is going to get.
St-tt-t-utter, b-b-bb-badly
Stutter on the letter "p."
Teach the order taker a secret code. Use the code on all subsequent orders.
Tell the order taker a rival pizza place is on the other line and you're going with the lowest bidder.
Tell the order taker to tell the manager to tell his supervisor he' fired.
Tell the order taker you're depressed. Get him/her to cheer you up.
Tell them to double-check to make sure your pizza is, in fact, dead.
Tell them to put the crust on top this time.
Terminate the call with, "Remember, we never had this conversation."
Try to talk while drinking something.
Use CB lingo where applicable.
Use expletives like "Great Caesar's Ghost" and "Joseph and Mary in Tinsel Town."
When listing toppings you want on your pizza, include another pizza.
When ordering a pizza, burst out in tears every 2 minutes
When the order is repeated, change it slightly. When it is repeated again, change it again. On the third time, say, "You just don't get it, do you?"
When they repeat your order, say, "Again, with a little more OOMPH this time."
When they say, "What would you like?"--say, "Huh? Oh, you mean now."
When they say, "Will that be all?"--snicker and say, "We'll find out, won't we?"
When you'ge given the price, say, "Ooooooo, that sounds complicated. I hate math."
While on the phone, fake entering puberty. Fluctuate pitch often; act embarrassed.
Wonder aloud if you should trim those nose hairs.
--------------------airplane-------------------------------
Act like a movie star.
Ask someone for their autograph, pretending that you think they're Tom Cruise or Madonna (This best when the person looks nothing like the movie star in question)
Ask the guy next to you to hold your dentures (senior citizens only)
Ask the person next to you, "Are you in the Witness Protection program too?"
Attempt to promote Hinduism among passengers
Bring a "Word-a-Day" calendar on board with you. Read every single word aloud and attempt to use it in a sentence. Use them all incorrectly. "My, you have a very irate home,' she said governessly."
Bring a cellular phone. Call God. Say, "The reception is much clearer up here...."
Bring a duffel bag packed with pipe cleaners, styrofoam balls, construction paper, etc. Organize a "Kraft Korner". Make a craft likeness of the person sitting next to you. Give yourself an "F".
Bring a microphone and act like Frank Sinatra
Bring your computer keyboard without a monitor. Place it on your lap. Stare into the palm of your hand. Wait. Push the return key a few times. Yell out "Yes! Alright! I told them I didn't need a laptop!" Plug the headphones into your nostril and play Doom.
Call the stewardess "nurse".
Continually offer to share your "Beano".
Decorate. Bring a scatter rug and tiny draperies. Hang a "Home Sweet Home" plaque on the back of the seat in front of you. Invite your fellow passengers in for tea.
Describe your sex life in great detail to the five-year-old next to you
Disco dance in the aisle
Don't use deoderant, then "accidently" stick your armpit in someone's face
During the inflight movie, ask to share headphones with someone
During the meal, loudly explain that on time you ate shark fin soup and proceeded to puke all over the airplane, spewing chunks of shark on the other passengers
Explain how, one time, the plane was crashing and the oxygen masks didn't come out, 'cause they aren't really reliable, and that if the plane was to crash, everyone would die
Fart loudly and act shocked, looking around to see who did it
Fiddle around with the emergency exit, then ask a fellow passenger if he has a crowbar
Get some rub-on tattoos and a leather jacket, pretend that you belong to a biker gang
Give someone a coin, saying "Heads, I detonate the bomb. Tails, I don't"
Go into the bathroom and make rude bodily noises, then come out looking refreshed.
Go into the bathroom, drop your pants, then come out, yelling "We're out of toilet paper! Stewardess!"
Go into the cockpit, ask the pilot in an obnoxious voice "Why do the call it the COCKpit?" then snort as if it's the funniest thing in the world
Go up to someone and ask loudly if they wouldn't mind applying Preporation H to your hemrrhoids.
Hum the Monty Python theme song.
If someone has a bad toupee, whack it off.
Jump up and scream "AAAHHH!! I left the stove on!!"
Lead a bible study session in the back of the plane.
Lead a revolt against the first class passengers.
Lean back in your seat, fold your arms behind your head and exclaim, "Thank God for auto-pilot, eh?"
Mess up your hair, untuck your shirt, basically look crude, and mingle with a first class guy as if you were long-lost friends
Moon passing Delta planes.
No matter what the meal choices are, demand rice-a-roni.
Pick your nose and pat the person next to you.
Pinch the stewardess' butt as she passes.
Pretend you're flying the plane.
Put on a ten foot diameter sombrero and slouch in your seat, whacking everyone on the head.
Remark that perhaps you shouldn't have put superglue in your undies that morning.
Ride carry-on luggage down the aisle, yelling "Yeee-ha!"
Say, "Did you know every time a plane crashes, an angel gets its wings?" Then sigh and stare dreamily into the clouds.
Scratch your butt, then sniff your finger.
Scream and dive under your seat for no apparent reason.
Show off your Batman underwear.
Sing along with the songs on your Walkman.
Snap Polaroids of him or her. Pull out an empty photo album and arrange the pictures inside it. Tuck the album under your jacket and say, "You know, in some cultures they believe that when you take a person's photograph...you own their soul...," while smiling maniacally.
Sneeze, using somebody's sleeve instead of your hand to cover it
Snort when you laugh
Speak in Spelling Bee-eese: "Hello. H-e-l-l-o. Hello. Nice weather we're having isn't it? Weather. W-e-a-t-h-e-r. Weather."
Spill soda "Accidentally" on the person next to you.
Sport a kamikaze helmet and goggles. Speak in a low voice into a hand held tape recorder: "Today's date, December 7th, 1941. I was not able to command my own personal plane but success shall still be ours...."
Start a hot dog stand.
Start singing the Shari Lewis theme, "This is the song that never ends, it just goes on and on my friends, some people started singing it not knowing what it was, and they'll continue singing it forever just because, this is the song that never ends...." Suddenly realize that you can never stop singing. Become very panicky. Scrawl "Help me" on a piece of paper and hand it to the person sitting next to you. Claw at your throat and thrash around in the seat. Never stop singing.
Steal a businessman's laptop, play solitaire on it.
Suddenly remember that you left your iron on. Ask if the pilot would mind going back so you can check.
Switch accents and see if anyone notices.
Tap at the windows, saying "Looks pretty tough" then ask somone if they have a bat you could use to test.
Tell corny jokes and laugh like it's absolutely hilarious, then expect others to do the same 46. Wear a hairpiece and switch it often, seeing if anyone notices
Tell the person next to you your life story, from DNA to that afternoon
Tell your fellow passenger that you just heard the bathrooms were out-of-order. Then pause and say, "Did you know that peanuts are a natural diuretic?" Smile.
Try to lead plane in song "Oh I wish I was an Oscar Myer Weiner"
When there's any nudity, say "Hey! He/she must be real cold!"
When they ask something, pretend that you don't know and you have to go ask someone else. Repeat wtih every question. (ie., "How are you today?" "How can I help you," "what would you like to order")
When two people kiss in the film, belch real loud.
Whip out your kazoo and give first class a special entertainment show.
With a desperate look, ask the stewardess where the bathroom is, then look relieved and say "Nevermind. Do you have any towels?"
With a fellow passenger, Re-enact the disco scene in "Airplane!"
With the person next to you, discuss cannabilism among airline crash passengers on deserted islands.
Yell out, "John Lithgow is on the wing!"

------------------------proffessors/teachers----------------
Bring a small cactus to class with you. Raise your hand, and when you're called on, say that the cactus has a question. Turn and look at the cactus, as if you're waiting for it to say something. After a few moments, shrug, and wait for your professor to move on. Do this once a day, and become increasingly irritated with the cactus every time, sighing heavily and giving it evil looks when it fails to "speak." When you leave the room after class, start yelling at the cactus, "I can't believe you embarrassed me AGAIN...."
Bring a vacuum to class. Halfway through class, stand up and start using it. If your professor objects, explain that you "can't stand sitting in this pigsty any longer." Keep vacuuming, grumbling angrily.
Brush your teeth during class. While doing so, raise your hand as if you have a question, and mumble your question incoherently while brushing, spewing toothpaste all over the place. If your professor objects to your actions, go on a tirade about proper oral hygiene.
Carve a bust of your professor out of cheese. Tie a ribbon around it, and present it to him/her at the beginning of class. Demand extra credit.
Come to class every day wearing scary Halloween masks. Try to get your professor to guess who you are. Shoot him/her with a water pistol, scream, and run around the room knocking things over. Say, "Pretty scary, huh?"
Come to class with a jar full of angry hornets. Five minutes into class, release the hornets, scream, and run away.
Dispute everything your professor says, no matter how simple. Try to get him/her to "prove" everything to you. Rant and rave about what a big liar your professor is. Yell at students who are taking notes, saying, "Stop writing down all these lies!"
Draw hearts and flowers on the backs of your papers and tests. Next to them, write things like, "You're the best, even though you suck" and "You're the worst professor in the world, but I still love you."
Every time your professor stutters, do a shot. If he/she objects, explain that drinking games make the class more interesting.
Get a monkey, and bring it to class with you. Tell your professor that you've hired the monkey to take notes for you. Sit back and relax during class, letting the monkey scribble on a piece of paper. When it comes time to write a paper or take a test, write down things like, "I wish I had a banana" and "I miss my tire swing." Assuming you get a bad grade, angrily fire the monkey in front of your professor.
Get the whole class to show up a few minutes early, and throw a surprise party for your professor. Insist that you can't start class until he/she has a piece of cake. Keep asking people when the strippers are going to arrive.
Hide somewhere inside the classroom. Wait for your professor to take attendance. Don't come out when he/she calls your name. Halfway through class, jump out and yell, "Just kidding! I'm here! Fooled you again!" Sit down and be quiet for the rest of class.
If you have an early morning class, get there before anyone else, and bring a pillow, some blankets, an air mattress, and an alarm clock. Wear your pajamas. Lie down on the air mattress with the pillow and the blankets and act like you're asleep. Have the alarm set for about two minutes into class. When it goes off, preferably very loudly, hit the "snooze" button and go back to sleep. Keep doing so for the duration of the class.
Instead of taking notes, do an abstract painting during every class. Call the paintings things like, "Professor Acting Like Mr. Know-It-All" or "Idiot Who Doesn't Know What The Hell He's Talking About." Give the paintings to your professor as gifts.
Keep "accidentally" setting fires at your desk. Burn notebooks, papers, or whatever you have handy. Whenever you start a fire, no matter how small it is, start yelling, "Fire! Fire!" and run out of the room in a panic. Don't return for the rest of class.
Show up to class about ten minutes late. Ride into the room on a bicycle, yell, "Look out!" and crash into the blackboard. Get up, take a seat, and act like nothing happened. Do this every day.
Sit way at the back of the room, up against the wall, to get as far away from your professor as possible. While he/she is lecturing, shout out things like, "What!?" and "Speak up! You're mumbling!" If your professor advises you to sit closer to the front, tell him/her you can't because you're scouting the room for "assassins."
Start asking questions in a fake foreign language. Act like your professor is stupid for not being able to understand you. Get other people in the class to start speaking the fake language too, and have frequent discussions during class. Act like you're really interested in what you're discussing. If your professor tries to interrupt or stop you, act annoyed and motion for him/her to quiet down.
Tell your professor that you'd like to interview him/her for a writing class. Get him/her to tell you his/her life story. Act interested, and write down everything he/she says. Fabricate a few romantic interludes and turn your efforts into a trashy romance novel. Make copies for the entire class, and your professor. Demand extra credit.
Wait for your professor to mention a date, and then yell out, "Bingo!" Apologize, and explain that you got confused.
When you have to write a paper, get it done early and mail it to your professor's house. From then on, don't hand anything in, and blame it on the sluggishness of the U.S. Postal Service.
When your professor gives you a syllabus, take it home, correct it, give it a grade, and return it to the professor. Demand extra credit.
Wrap yourself in bandages and come to class in a wheelchair. Throughout class, cry a lot and moan things like, "Why me?" and "Please kill me!" Get up during class, like your going to miraculously start walking. Instead, fall down, cry out in pain, and wait for someone to help you back up. When class is over say, "I feel better now," leap up, and run home.
Write down everything that your professor says, word for word. Think up a melody, and turn the words into a song. Bring a guitar to class and perform the song for the class. Explain to your professor that he/she is "very inspiring."
Write your professor a note that says, "I'm going to be about 15 minutes late. Go ahead and start without me." Wait outside the building until the time when class is supposed to begin. Tie the note to a rock, and throw it through the window.

--------------------------------cops---------------------------------
Hey, you must've been doin' 125 mph to keep up with me!
Sorry, officer, I didn't realize my radar detector wasn't plugged in.
Hi, officer. Do you mind holding my beer while I find my license?
I thought you had to be in relatively good shape to be a police officer.
You know, I was going to be a cop, but I decided to finish high school instead.
Bad cop! No doughnut!
You're not gonna check the trunk, are you?
Didn't I see you get your butt kicked last week on "Cops?"
Wow, you look like the guy in the picture next to my girlfriend's bed.
I bet you I can grab that gun before you finish writing my ticket.
So, you on the take, or what?
Aren't you the guy from the villiage people?
Didn't I see you get your butt kicked on COPS?
Do you know why you pulled me over? Okay, just so one of us does.
Gee officer, that's terrific. The last officer only gave me a warning.
Gee, that gut sure doesn't inspire confidence.
Hey, can you give me another one of those full cavity searches?
Hey, is that a 9mm? That's nothing compared to this 44 magnum.
Hey, you must have been doing 125 to keep up with me, good job.
I can't reach my license unless you hold my beer.
I pay your salary.
I thought you had to be in relatively good physical shape to be a police officer.
I was going to be a cop, but I decided to finish high school instead.
I was trying to keep up with traffic. Yes, I know there are no other cars around, that's how far they are ahead of me.
Is it true that people become cops because they are too dumb to work at McDonalds.
So uh, you on the take or what?
Sorry officer, I didn't realize my radar detector wasn't plugged in.
Well, when I reached down to pick up my bag of crack, my gun fell off of my lap and got lodged between the brake and the gas pedal, forcing me to speed out of control.
What do you mean have I been drinking? You are the trained specialist.
Wow, you look just like the guy in the picture on my girlfriend's night stand.
You're not going to check the trunk, are you?
--------------------------------discount shops and stuff-------------------
Accidentally" get stuck in one of the frozen food doors. Give people strange looks and see if anyone helps you out.
Add really funny things to other peoples’ carts and watch them pay for it and see if they notice.
Around Christmas time, start caroling. Ask for money from the listeners.
As the cashier runs your purchases over the scanner, look mesmerized and say, "Wow. Magic!"
Ask if you can buy a shopping cart.
Ask other customers if they have any Grey Poupon.
Ask Someone if they know were they sell little babies!
Attempt to fit into very large gym bags.
Bring a friend and get in a shopping cart. Have them push you around while you yell "ye-haw!"
Buy chrome hubcaps and put them on in the parking lot
Challenge other customers to duels with tubes of gift wrap.
Constantly wink at a person you don't know. Follow them around and blow kisses to them.
Dart around suspiciously while humming the theme from "Mission: Impossible."
Do all of these above without getting thrown out! Contributed
Drag a lounge chair on display over to the magazines and relax. If the store has a food court, buy a soft drink; explain that you don't get out much, and ask if they can put a little umbrella in it.
Drape a blanket around your shoulders and run around saying, "...I'm Batman. Come, Robin--to the Batcave!"
Dress as a Jedi and randomly tell other shoppers in you're best Yoda voice,"May the force be with you".
Everytime you walk out the door (or try waiting by the door for others to walk out), make a dinging noise then say mechanically "We're sorry. You have activated the Wal Mart inventory control service. Please step back and a Wal Mart associate will help you. Thank you."
Fill your shopping cart with matchbooks and gasoline and walk around smiling at people.
Find a parent with her kid in the shopping cart. Point at the kid and ask the parent, "What aisle are they selling these on?"
Follow people through the aisles, always staying about five feet away. Continue to do this until they leave the department.
Gather a bunch of bouncy balls and bounce them into neighboring aisles.
Get 20 people together and play hide-n-go-seek.
Get a dish towel and bucket and sit on the floor singing "It's a hard knock life for us!"
Get a friend, put on as many articles of clothing you can find and start sumo wrestling (use diapers if possible) .
Get a group of friends together and take lawn chairs from the display then rewind the movie playing on the display TV in electronics, sit down and watch the entire thing.
Get one of those fake dogs that barks/sings, place it on the ground in front of a group of people and press the button to make it sing/bark. Then proceed to bark and growl like you are going to attack it
Go into the dressing room and yell real loud... “Hey, we’re out of toilet paper in here!”
Go to the express lane and get an item, and say "wait, I forgot something, and keep doing that until you have like 50, check out, then say "thanks, I forgot how much this costs," and walk away.
Go to the video game section and play one of the games for a minute the throw down the controller and start to bang on the display case when an attendant asks u what u are doing tell him your trying to change the game.
Go up to a guy and start crying saying I finally found you mommy! And see what he does!
Go up to someone and start taking items from their basket and put them into yours.
Go up to the clerk and say code Red! and see what they do! (I know it will work I did it.)
Grab handfulls of super bounce balls and go wild.
have a couple of friends go with you and dress up as power rangers. Battle the invisible enemy and tell shoppers to stand back.
Hide in the clothing racks and when people browse through, say things like “Pick me! Pick me!!”
hide in the toy section, when someone comes close jump out at them throw a ball and yell "Pikachu I choose you!"
Hold indoor shopping cart races.
In the auto department, practice your "Madonna" look with various funnels.
Joust with the electronic assist carts and wrapping paper (they usually won't throw you out)
Leave Cheerios in Lawn and Garden, pillows in the pet food aisle, etc.
Leave cryptic messages on the typewriters.
Look right into the security camera, and use it as a mirror while you pick your nose.
Make a trail of orange juice on the floor, leading to the rest rooms.
Make farting noises as you walk by someone.
Make the entire auto department smell by sampling all the spray air fresheners.
Make up nonsense products and ask newly hired employees if there are any in stock, i.e., "Do you have any Shnerples here?"
Move "Caution: Wet Floor" signs to carpeted areas.
Nonchalantly "test" the brushes and combs in Cosmetics.
Page yourself and then after the employee says your name, say...“Oh that's me, I've got to go. Thank you.”
Pay off layaways fifty cents at a time.
Play "Marco Polo."
Play blind chicken with 12 friends putting a blind fold on one and them having that person trying to find you .
Play soccer with a group of friends, using the entire store as your playing field.
Play with the automatic doors.
Play with the calculators so that they all spell "hello" upside down.
Pour bubble bath into the fountains in the garden section.
Put M&M's on layaway.
Put random items in the shopping carts of others while they aren't looking.
Randomly throw things over into neighboring aisles.
"Re-alphabetize" the CD's in Electronics.
Re-dress the mannequins as you see fit.
Relax in the patio furniture until you get kicked out.
Repeat whatever the store clerk tells you.
Ride a display bicycle through the store; claim you're taking it for a "test drive."
Ride those little electronic cars at the front of the store.
roll cans of soup down the aisles.
run around the store yelling I'm a princess while holding a toy wand.
Run around yelling for your pet ferret "Stinky". check out all the funny looks you get!
Run up to a complete stranger and say "You're it!"
Run up to a new employee in the pet aisle and point to an invisible cash register and say "Hey you! That cash register over there, well um, I think it's magic! It made my little sister (or brother if you have one) disappear!" Wait and see what they say and the expression on their face.
Sample all the fragrances in the perfume department.
Say things like, "Would you be so kind as to direct me to your Twinkies?"
Set all the alarm clocks to go off at ten minute intervals throughout the day.
Set up a "Valet Parking" sign in front of the store.
Set up a battle of laser tag .
Set up a tent in the camping department; tell others you'll only invite them in if they bring pillows from Bed and Bath.
set up like ten pineapples in the shape of bowling pins and start bowling with a coconut.
Shoot the bungee tops at customers.
Start Humming the Teenage Mutant Ninja Turtle Theme song. Whenever someone looks at an item near you scream "TUTLE POWER" and run away as fast as you can.
Strategically scatter those novelty dog poops throughout the store and wait for some to announce "cleanup on aisle ..." then yell "BAD FLUFFY!"
Switch the men’s and women’s signs on the doors of the restroom.
Take a snickers bar, go in the bathroom and smoosh the snickers bar in your hand and reach over to the next stall and say "uh do you have some toilet paper over there?"
Take all of the free AOL cd's on the end of the check out counter Contributed by Keith
Take bets on the battle described above.
Take shopping carts for the express purpose of filling them and stranding them at strategic locations.
Take up an entire aisle in Toys by setting up a full scale battlefield with G.I. Joes vs. the X-Men.
Test the fishing rods and see what you can "catch" from the other aisles.
Throw as many shoes as possible onto the floor in as little time as you can.
TP as much of the store as possible.
Try to fly on a broom. If anyone asks what you are doing tell them in a very annoyed voice, "the brooms don't work!"
Tune all the radios to a polka station; then turn them all off and turn the volumes to "10".
Unload then entire bin of giant bouncy balls, get in the bin, have a friend put all the balls back on top of you. When someone walks by jump outta the balls causing them to fly everywhere.
Walk about 10 centimeters in front of a moving shopping cart and yell "Its gonna get me!"
walk around in rubber boots , a rain coat, and an umbrella on bright sunny day!
Walk through the store pushing a cart that is upside-down.
Walk up and down yelling mommy , mommy then keep saying out loud have you seen my mommy I'm lost and I cant find her.
Walk up to a person and say I'm the FBI and I heard that you have been shopelifting and we need to check you.
Walk up to an employee and ask where the laxatives are, changing your voice as if you really need it.
Walk up to an employee and tell him in an official tone, "I think we've got a Code 3 in Housewares," and see what happens.
Walk up to complete strangers and say, "Hi! I haven't seen you in so long!..." etc. See if they play along to avoid embarrassment.
Walk up to the automatic doors and walk back and forth through them and each time u go though look up at the sensor and yell "how does it work or ITS MAGIC!"
When a woman with children walks near you in the toy aisle, throw yourself on the floor, screaming "mommy, I want that toy"
When an announcement comes over the loudspeaker, assume the fetal position and scream, "No, no! It's those voices again!"
When someone asks if you need help, begin to cry and ask, "Why won't you people just leave me alone?"
when someone steps away from their cart to look at something quickly make off with it without saying a word.
When someone steps away from their cart to look at something, quickly make off with it without saying a word.
when the speaker/pager deal comes on start mimicking them.
When there are people behind you, walk REALLY SLOW, especially thin narrow aisles.
When two or three people are walking ahead of you, run between them, yelling, "Red Rover!"
While handling guns in the hunting department, suddenly ask the clerk if he knows where the anti-depressants are. Act as spastic as possible.
While playing a video game in the Electronics, skip side-by-side, wiggle your butt, and hum to the music. Contributed by MOOSE!!!!
While walking alone pretend you are have a serious conversation with someone.
While walking through the clothing department, ask yourself loud enough for all to hear, "Who BUYS this crud, anyway?"
------------------------------stuff to say to other people------------------
Check out this infected canker sore in my mouth!
I work for the IRS.
Have you ever tried cat meat?
I don't know why I ate it - liver and onions always gives me gas.
I just had a proctological exam - wow, worth every penny!
The last time my head rang like this I woke up with a dead man next to me!
I puked on the last person who flew next to me.
My butt reeeally itches!
Would you look at the size of the hair I just yanked out of my nose!
My psychiatrist says that flying helps offset my desire to mutilate small, defenseless, woodland creatures.
The last guy who ignored me is still on a respirator.
Would you hold this messy kleenex for me?
Wanna see my tonsils? I keep them in a jar.
I haven't changed my underwear in over two weeks! How about you?
The doctors say that my eighth personality is the least dangerous.
Wow, look at that little boy in the third row!
Can you believe they only gave me three years for killing my own sister?!
Hey, does your urine ever turn blue?
I get a proctological exam once a week, whether I need it or not!
This cramped fuselage reminds me of solitary.
Oh damn, my diaper's wet again!
If I go unconscious just stick your finger down my throat - that'll wake me up.
Wanna buy a gerbil?
Boy, that business at Waco was a mess - I got outa there right behind the Savior David!
Ya know, since I moved to West Hollywood my gerbil business has really taken off.
Wow, they could charge for that cavity search they gave me at the border!
I've just been treated for tapeworms.
Don Knotts is my favorite actor!
I work for the city of San Gabriel and I drive a garbage truck.
The pilot and I were in the same drug rehab clinic - he was doing much better when I left a couple days ago.
Did I tell you Charles Manson's my uncle?
I collect aluminum foil.
Ya know, these days a man can't hang out with a seven year old boy without being ridiculed by his peers!
I work in a landfill.
I remember, not too long ago, when a man could work hard clubbing baby seals all day long and then go home and have a tall, cold one with a clear conscience.
I have every album the Bee Gees ever recorded!
I work on a Japanese whaling ship.
We're planning on leaving our bodies and meeting with the mother ship next Tuesday -- wanna come?
---------------------------------------drive through window--------------------
Specify that this order is "To Go".
• Drive through the drive in backwards and let your rear seat passenger make the order.
• At midnight, ask if you are too early for Breakfast.
• When Ordering, start talking about the problems you were having with your car. Ask if somebody can take a look at it.
• Pay for a large order in pennies and nickels unwrapped.
• Laugh loudly when asked if you would like fries with your order.
• Demand to speak to the manager. When he comes on, complain that you did not like the way the employee said "Would you like fries with your order?"
• When asked if they can take your order, tell them you are just looking and drive off.
• Tell them you have to use the bathroom - Don't Order anything.
• Order a hamburger, no bun with two ketchup sachets - Thats all.
• Just stare at them when you pay and get your food. Don't break your stare and say " I know what you did to my food ! ".
• When they hand you your food, hand them a bag back with all the rubbish from your car in it.
Honk your horn the whole way through the line.
• When they come on the intercom, say "Sorry, I'm not here at the moment, please leave me a message".
• Pretend like your window is broken. Tell the employee this. Order with your door open, pay with your door open. Roll down window and take food through the window.
• Stand close to the speaker and yell your order, using colorful expletives in ways which would embarrass the patrons inside.
• After ordering, cover the speaker and mic with transparent tape. Watch as customers and order-takers are unable to hear each other and, thus, each raises his/her volume.
• Speak a foreign language (make one up if you have to). When the manager comes to the mic, speak English and inquire as to why the order taker had such difficulty understanding you.
• Attempt to take the order-takers order ("Hi, may I take your order?") before they get a chance to take yours.
• Order confusing items, i.e., "Hi, I'll have a large orange Coke and a small medium fries, please."
• In a crowded drive-thru line, place a HUGE order, then slip out of line and watch the fun as the person behind you is handed 40 bags of food.
• When you arrive at the window to pick up your food, hand them several bags of garbage and ask if they'll dispose of it for you. Make sure it smells.
• Drive through with a car load of naked people.
• Speak in such a garbled fashion that the order-taker will think there is a problem with the speaker and ask you to order at the window. When you arrive at the window, speak in the same garbled, incomprehensible fashion.
• Drive through with someone on the hood to accept the food.
• Bring along a Mr. Microphone. When the order-taker speaks, aim the mic at their speaker but do so while aiming the Mr. Microphone speaker at the mic to produce excruciating feedback of their own voice.
• Have a friend hide in the trunk. When you approach the window to pickup your order, have him start yelling and banging his fists on the trunk.
• If you are a male, have a female friend place the order by speaking VERY seductively and suggestively into the speaker. When she finishes, have her hide and pull up to accept your order. See how many of the order-takers fellow employees have been called over to the window to "check out the babe."
• All of the above work very well when done at the late night pick up window.
------------------------------malls-----------------------------
Ride mechanical horses with coins fished out of the reflecting pond.
Try pants on backwards at the Grap. Ask the salesperson if they make your butt look big.
Dial 900 numbers from demonstration phones in Radio Shlock.
Sneeze on the sample tray at Heckory Farms and helpfully volunteer to consume its now unwanted contents.
At the bottom of an escalator, scream “My SHOELACES! AAAGH!”
Ask the sales personnel at the music store whether inflated CD prices are in pesos or rubles.
Teach pet store parrots new vocabulary that makes them unsalable.
.Stomp on ketchup packets at Burger Queen...
....but save a few to slurp on as snacks. Tell people that they’re “astronaut food”.
Follow patrons of D. Balton’s around while reading aloud from Dianetics.
Ask mall cops for stories of World War I.
Ask a salesman why a particular TV is labeled black and white and insist that it’s a color set. When he disagrees, give him a strange look and say, “You mean you really can’t see it?”
Construct a new porch deck in the tool department of Snears.
Wear pancake makeup and new clothes and pose as a fashion dummy in clothes departments, occasionally screaming without warning.
Test mattresses in your pajamas.
Ask the tobacconist if his hovercraft is full of eels.
If you’re patient, stare intently into a surveillance camera for an hour while rocking from side to side.
Sprint up the down escalator.
Stare at static on a display TV and challenge other shoppers whether they, too, can see the “hidden picture”.
Ask appliance personnel if they have any TVs that play only in Spanish.
Make unusual requests at the Piercing Pagoda.
Ask a salesperson in the hardware department how well a
At the pet store, ask if they have bulk discounts on gerbils, and whether there’s much meat on them.
Hula dance by the demonstration air conditioner.
Ask for red-tinted lenses at the optometrist.
Sneak up on saleswomen at the perfume counter and spray *them* with your own bottle of Eau de Swanke.
Rummage through the jelly bean bin at the candy store, insisting that you lost a contact lens.
Ask a saleswoman whether a particular shade of panties matches the color of your beard.
In the changing rooms, announce in a singsong voice, “I see London, I see France...”
Leave on the plastic string connecting a new pair of shoes, and wander around the mall taking two-inch steps.
Play the tuba for change.
Ask the Hamond organ dealer if he can play “Jesus Built My Hotrod”.
Record belches on electronic sampling keyboards, and perform gastric versions of Jingle Bells for admiring onlookers.
Ask the pharmacist at the drugstore which leading cold remedy will “give you a really wicked buzz.”
Ask the personnel at Peer 1 Imports whether they have “any giant junk made out of straw.”
“Toast” plastic gag hot dogs in front of the fake fireplace display.
Collect stacks of paint brochures and hand them out as religious tracts.
Ask the information desk for a stroller, and someone to push you around in it.
Change every TV in the electronics department to a station showing “Saved by the Bell”.
Chant the dialogue in a robotic voice, and scream if anyone tries to switch channels on one of the sets.
Hang out in the waterbed section of the furniture department wearing a Navy uniform. Occasionally run around in circles yelling “scratch one flat top!”
Hand a stack of pants back to the changing room attendant and scornfully announce that none of them are “leakproof”.
“Play” the demo modes of video games at the arcade. Make lots of explosion noises.
Stand transfixed in front of a mirror bobbing your head up and down.
Pay for all your purchases with two-dollar bills to provoke arguments over whether they’re real.
If it’s Christmas, ask the mall Santa to sit on *your* lap.
Answer any unattended service phones that ring in department stores and say “Domino’s.”
Try on flea collars at the pet store while occasionally pausing to scratch yourself.
At the stylist, ask to have the hair on your back permed.
Show people your driver’s license and demand to know “whether they’ve seen this man.”
Buy a jawbreaker from the candy store. Return fifteen minutes later, fish it out of your mouth, and demand to know why it hasn’t turned blue yet.
Walk up the skinniest stairs in the mall with your arms out not letting anyone pass and walkin really slow. And any time someone is near yell.
Find one of the huge boom-boxes and turn it to some rock station. Then, turn it off and turn the volume all the way up. Then the next person to check it out will have great fun!
Set all of the alarm clocks in any of the Bed & Bath stores to go off every ten minutes on the loudest setting possible.
Buy the largest soda the stores have available, drink it down to the last inch, then stand behind someone while slurping up the remainding soda as loud as possible,when they tell you to stop it retort that you don't like to waste things.
Men go into women's clothes stores and try on skirts, underclothes, swimsuits, etc. Ask shop assisants what they think (vise-versa for women)
Bring survial gear and "live" in one of the tents in a camping shops. Scream "Help" & "We're under fire" every 5 mins. Make battle noises as well!
Wear you swimming clothes and go swimming in the coin pool! Wear armbands and a rubber ring for extra effect!
Start a sing along in the middle of the mall.
Print lots of "Fake" money, go into the mall (second floor if available) amd throw it all away.
Go into a pet shop and release all the birds, parrots etc. Screaming at the top of your voice "Be free my feathered friends"
Follow someone with children around yelling "mommy I want that!"
Take the money out the fountain while swimming and hand it out to people,spend it or if possible throw it from the second floor (it might hurt someone)
Add strange growths to the giant lego men in the toy stores
Put weird backgrounds on store computers when people aren't looking.
buy a feather boa at a clothing store and hang on to the rail while waving it and screaming "Look everyone I can fly!"
Stand in front of the Gap. "Fall" in repeatedly. Threaten legal action.
When ever someone makes an annoncment over the loud speakers cover your ears and scream "The voices...the voices...make them stop"
With a friend, speak in a different language (or make up your own) and make a seen, pointing at signs and people as if they were something shiny and new that you've never seen before. Pretend you're a tourist.
Walk right on people\'s heels and when they look back at you stop and look at the celing and when they turn back around countine
Annoying Things To Do During a Boring Sermon
Pass a note to the organist asking whether he/she plays requests.
See if a yawn really is contagious.
Slap your neighbor. See if they turn the other cheek. If not, raise your hand and tell the preacher.
Devise ways of climbing into the balcony without using the stairs.
Listen for your preacher to use a word beginning with “A” then “B” and so on through the alphabet.
Sit in the back row and roll a handful of marbles under the pews ahead of you. After the service, credit yourself with 10 points for every marble that made it to the front.
Using church bulletins or visitor cards for raw materials, design, test and modify a collection of paper airplanes.
Start from the back of the church and try to crawl all the way to the front, under the pews, without being noticed.
Raise your hand and ask for permission to go to the rest room.
Whip out a hankie and blow your nose. Vary the pressure exerted on your nostrils and trumpet out a rendition of your favorite hymn.
Chew gum... if the sermon goes on for more than 15 minutes, start blowing bubbles.
Try to indicate to the minister that his fly is undone.
By unobtrusively drawing your arms up into your sleeves, turn your shirt around backwards.
Try to raise one eyebrow.
Crack your knuckles.
Twiddle your thumbs.
Wiggle your ears so that the people behind you will notice.
When the service gets long, write the time on the back of a bulletin, hold it up for the preacher to see, and up date it every five minutes.
Grab the bulletin and start redesigning the church symbol.
Make faces at the person on the other side of the room and see if you get other peoples attention.
Produce your own light show with the overhead projector. Mouth the word "lightning" to the pastor.
Say "Amen" every time the pastor says "Lord" or "Father."
--------------------------------bowling ally-----------------
Pray to the pins, leave sacrifices
Wear golf shoes.
Every time you throw exclaim "TAKE THAT, YOU JERKS!" Continue this behavior until forcefully thrown out.
When ever a strike "X" appears on the screen, start yelling about how this is a Black Panther conspiracy.
Explain to the owner how your game is "All sorts of messed up" due to plate tectonics, then lose him in lingo. Demand compensation.
Make lewd and graphic references to your "ball". Works well on Senior Ladies night
Play bocci with extra lane balls
Try to juggle the balls, when you drop them, start screaming about plate tectonics again.
Every ten minutes run the entire length of the building beating your own head and speaking in tongues, then sit down as if nothing happened
Bring full angling gear, ask how they're biting.
Completely cover your ball in duct tape (sticky side out) then loudly complain about how your hook is off.
Hide behind the pins, stick your head up laughing hysterically
Use a curling weight instead, bring a full team of sweepers
Throw refuse down the ball return, tell the owner the trash compactor is busted
Make your presence known by arranging pentagrams out of candles on every lane except yours
Root for the other team - bring banners.
Make fun of your team - bring lettuce.
Bring a foghorn, use at crucial moments.
Even if you miss totally--At the top of your lungs scream STEEEEEERIKE
Bring a small gold idol, demand the other team pray to it.
Rent all the lanes, don't bowl.
Blatently UNderscore yourself, then accuse the other team of cheating.
When an opponent is on his backswing, race up and take his ball and run home.
If your team is in the finals, throw nothing but gutterballs and blame plate tectonics.
Trip EVERY member of the opposing team, trip your team, trip everyone.
Wear a baseball uniform, bowl sidearm.
Superglue police whistles to the hand-dryers. Leave town.
Walk around asking people why they are here. Do this the whole night.
Ask to use the house mic. Say you want to make an announcement, then expound on the sins of bowling.
Name your ball something like "KILLER". Openly boast to everyone how great you are, throw like a wimp, do this all night
Sit in your lane and heckle others with a bullhorn.
Bring a dartgun. Be inventive.
Wrestle with your ball. (WWF Style) Ask someone to ref.
Run around sprinkling "magic fairy dust" on everyone's balls.
Sponsor a Really Big Open Bowl Night. Don't even have a entrance Fee, advertise it like crazy using every mass media known to man, make the 3rd Prize $10,000 and a Porsche, the 2nd Prize $5,000 and a trip to Europe and 1st Prize a coffee mug. Then sit back a watch the fights. Leave.
----------------------------movies---------------------
Throw popcorn in the air and yell, "It's snowing!"
Go, "Oooooh..." whenever anyone kisses.
Clap when the good guy gets killed.
During the previews, yell, "Can you fast-forward it?"
Whenever the bad guy is doing something devious, say, "Watch out!"
Laugh very loudly at all the corny jokes.
Tell the man selling popcorn that the bathroom is flooding.
Yell out what is going to happen.
Wear a cape and when its your turn to get popcorn yell, "I'm Batman! Hahaha!" and run away.
Say that they cannot sit next to you because you invisible friend already is.
Dress for every movie as if it were the Rocky Horror Picture Show.
Use empty chairs next to you as catapults with candy. Aim at specific people behind you and see if you can hit anyone in the back row.
Wear 3d glasses. Complain loudly how bad the effect are.
Bring a flashlight. In the middle of the film do shadow puppets on the ceiling.
Bring a remote control. Complain that you can't change the channel.
Sit front row, the minute the movie starts run out screaming.
Every time a character's name is mentioned do the Richmeister. (for a guy named Nick say, the Nickmeister, the Nickenator, Nickarino...)
Bring a beach ball. Toss it around.
Try to start a wave.
Become a bookie. Take bets on who will die first.
Sit in the back and throw eggs at the projection window.
Every time someone curses cover your ears and scream, "No profanity!"
Sing with the theme music.
Bring and use your own air freshener.
At the ticket booth, request tickets for really old movies, "I'll have two tickets for the Goonies."
Throw spit wads on the screen. Try throwing them on the upper part of the screen so they can't get scraped off.
Pass around a collection plate and see if anyone contributes.
Point a laser pointer at the screen. Give the audience a laser light show.
Bring a book and a bright light. Start reading the book with the light on. When someone asks you to turn out the light, yell, "Shh, I'm trying to read!"
Use binoculars. Stare at the audience rather than the movie.
Bring a Nintendo laser gun. Shoot at the screen.
Clap loudly every time a person walks into the theater late.
When someone kicks the back of your chair, scream, "Ahhh, whiplash!"
Ask what the theater's return policy on popcorn is.
Ask the person at the ticket window, "Do you work here?"
Start a standing ovation at the end of the movie.
Quote all dialogue 4 seconds after it is said on the screen.
Get up frequently and leave the room while singing "Let's all go to the Lobby to get ourselves a treat"
Every time there is a gun shot scream, "Hit the floor!", jump on the floor, and cover your head.
Wear one of those "cat in the hat" top hats.
Get 3 people together and act like you are Crow, Tom Servo, and Joel from Mystery Science Theater 3000.
Before the movie starts, stand up, and imitate the Truth commercial saying, "The makers of this film couldn't find any way to make their characters rebellious, rockin`, or cool so instead, they'll just smoke."
When someone walks by you in the aisle scream, "Ahhhhhh! Bad Touch!"
Play musical chairs, getting up frequently and moving right next to someone sitting by themself.
Bring your own beanbag chair and sit in the aisle.
During a love scene, stand up and run to the screen shouting "Hooters!"
Before the movie begins, tape fart cusions to various chairs in the theater room.
Bring a portable air popper, pop your own popcorn.
Bring a watergun and shoot it at anyone who begins talking.
Tie a cardboard box around your waist and walk up and down the aisles shouting "Get your popcorn, peanuts!"
Cough really loudly right at the most important part of the movie, so nobody can here it, like when the killer’s name is going to be said.
Bring a flashlight and shine it on the walls or ceiling, in advance draw an outline o#*@!uy screwing a chick (or perhaps another guy), then cut
out the outline and put it in front of the flashlight, so the image can be seen on the wall or ceiling.
Laugh hysterically during the sad parts in the movie, cry during the funny ones.
Smuggle in cans of roaches, locusts, ants, and other bugs that can annoy and reproduce quickly. You may even bring in some rats. Then sit in the very back, open the jars, and toss the bugs out on the ground. Since the floor is more slanted in the back the bugs will spread
throughout the theater faster. Be sure to be the first one to raise and scream "There’s a #*@!roach crawling up my leg!" Then run out into the
lobby and start yelling "there’s #*@!roaches in here!" Or "This theater is contaminated!" The theater will have to close down and fumigate the
showroom(s), and after this little "accident" no one will want to go back to the theater anyway!
Bring a pager or cellphone and set them off every 5 minutes, you can also set off a watch alarm if you have a loud one.
Say "Shhhhh" every 5 minutes.
Pass by a room that’s showing a movie you’ve already seen, put your head into the room, and scream the ending.
-------------------------------------school---------------------
organize a bunch of people in one class to emit a low humming noise, keeping straight faces.
organize a whole bunch of people to fall off their chairs at the same time.
organize a whole bunch of people to drop their pencils/pens at a preset time.
superglue quarters to the floor, count how many people try to pick them up.
write fake love notes and slip them into people's lockers
if someone near you falls asleep in class, tie their shoelaces to the desk/chair.
lay a paper towel roll on the floor at the top of the steps and give it a kick, making sure you've taped the loose end to the floor already.
place chalk inside the erasers so the teachers end up putting big 'ol lines across the blackboard.
when you use the bathroom, get a LOT of soap on your hands (If it's the slimy kind), but don't wash it off, just leave goo all over doorknobs, railings, etc.
screaming gibberish in crowded hallways is always good for a laugh.
leave a Snickers bar in the toilet.
ask people to hold your hand when going down the stairs
Type every word in a different font. Alternate really big fonts with really small fonts.
Bring candles and incense to class. Before handing in the paper, perform an elaborate ceremony, entreating the gods to bless the paper and correct all your typos.
Carve your paper on the bathroom wall.
Cite issues of Spiderman and Batman as resources in your bibliography.
Come to class leading a horse or camel. When asked to turn in the paper, take it out of one of the saddlebags, then shoot the horse/camel/whatever away. Refuse to discuss it.
Compare and contrast the characters of James T. Kirk and Jean-Luc Picard. Claim that one is actually Hamlet, and the other is King Lear. Say that Worf is Ophelia.
Draw obscure connections between totally unrelated things. For example, claim that abnormal amounts of neutrino activity in Germany caused Hitler to invade France, or that the Roman empire collapsed because of a shortage of qualified botanists.
Draw pictures of your professor in the margins.
End the paper with "This paper will self-destruct in 10 seconds".
Get a large piece of paper or canvas. Smear paint all over it and hand it in as your paper. Explain that the topic was such an emotional one for you, and that mere words couldn't possibly express what you had to say.
Hand your paper in in a sealed envelope with postmarks from several different countries on it. Say that you wanted several different perspectives on your work.
If assigned a 2000-word paper, draw two pictures of what the paper was supposed to be about. After all, a picture is worth 1000 words, right?
If assigned a paper in philosophy class, explain that you can't do the paper because you're not sure if the class really exists, or if it and the professor are just illusions created by your subconscious. If you do end up writing the paper, write about whether or not the paper actually exists.
Make a footprint on the back of one of the pages. When questioned by the professor, act like it's nothing unusual. After all, he did tell you to include footnotes.
Make a tape of you singing the contents of your paper, opera- style, and hand that in.
Make your paper one long, neverending sentence that goes on for pages and pages and pages; use alot of semi-colons, commas, and other interesting, rarely-used punctuation marks [(for example), an interesting one: the colon_] but never ever end the sentence {[_-|/??!]}.
Ol, switch alound arr the l's and r's in youl papel, rike Monty Python did in Queen Erizabeth the Thild.
On the day the paper is due, skip into class, waving the paper and screaming, "I have a paper! I have a paper!". Run around the class a few times, then joyfully throw it out the window. Laugh and yell, "There's my paper!", then run outside to get it. Repeat this all through the period, or until the prof throws you out.
Paint a large white stripe down the front of your paper. Say that on the way to class, your dropped it in the street and it got run over by one of those trucks that paint lines on the road.
Perfume the paper with catnip. Explain that it was to keep your dog from eating it.
Poke several holes in the paper. Say that you were mobbed by crows on the way to class.
Print all the pages on one sheet of paper, with the text overlapping. Say that that was all the paper you had.
Put nonsense words down as quotes. Say that you are quoting the words of a well-known Zen master who was speaking in tongues at the time.
Pwetend you have a speech impediment and awways type w's whenevew you weawwy want to type r's ow l's.
Refer to all prominant historical figures by nicknames. For example, call George Washington "Georgie". Call Ben Franklin "Sparky".
Refuse to do the paper on account of the fact that you are a member of Greenpeace and strongly object to the gratuitous slaughter of trees caused by the massive amount of paper used in writing assignments.
Spill a martini on your sociology paper. Say that you wrote it in a bar so that you could see "sociology in action."
Staple a picture of an academic building to the paper. Cite the picture as a resource.
Support your thesis with quotes from your VCR manual.
Switch the names of prominent history figures with the names of your friends, classmates, etc. Claim that your roommate led the Spanish Armada.
TTyyppee eevveerryy lleetttteerr ttwwiiccee..
Tell the professor that you need an extension because one of your primary sources is an old wise man in Tibet and he won't see you until the next full moon.
The night before the paper is due, call the professor and explain that you can't turn your paper in because it contains sensitive military information and is only available on a "need to know" basis. Insist that General Schwarzkopf says you should get an 'A'.
Turn in a letter you wrote to your cousin. When the teacher confronts you about it, say that you must have gotten the letter and the paper mixed up. Say that you'll turn the paper in as soon as you get it back, but your cousin lives in Siberia, so it might take a while.(This is a nifty way to get an extension.)
Turn the paper in by making paper airplanes out of the pages of the paper and attempting to fly them onto the professor's desk.
Type gibberish. When you hand it in, claim that your computer crashed while you were printing it, and you couldn't retrieve the original.
Use a forklift to bring your paper to class, even if it's only a few pages. Explain that it involved some very heavy reading.
When writing an especially long paper, put a recipe for chocolate cake in the middle and see if the professor notices.
When your prof asks for an outline of your paper, draw the outline of the piece of paper you typed it on and hand it in.
Write a paper discussing why Michelangelo got to be a Teenage Mutant Ninja Turtle, but Van Gogh didn't. Discuss whether Van Gogh would have used nunchakus or katanas.
Write about whether Plato would have said that Miller Light is "less filling" or that it "tastes great". Also explain why Aristotle would have taken the opposite view. Try to predict both philosphers' reactions to Spuds McKensie.
Write the entire paper on Post-it notes and turn it in by sticking them all over the professor's door.
Write your history paper on parchment, using a quill. Say that you were trying to get the feel for the period.
Write your paper by cutting out words from magazines and sticking them on the page, ransom-note style.
Write your psychology paper on possible genetic anomalies that might cause a person to prefer anchovies.
-----------------------------------parents -----------------------------
Paint your windows.
Boil ice cream.
Join Hell's Angels by mail.
Redecorate your garage.
Kidnap Cabbage Patch Kids.
Bury your fathers car. Tell your him the dog did it.
Challenge the neighbor kid to duel.
Climb a sidewalk.
Donate your brother's body to science.
Have your cat bronzed.
Hot wax the bottoms of your brother's dress shoes.
Learn to type...with your toes.
Make a quilt out of used cocktail napkins.
Mow your carpet.
Paint your home...day-glo orange.
Pinstripe your driveway.
Plant a shoe.
Play Houdini with one of your siblings.
Plot the overthrow of your local School Board.
Pour instant concrete in your brothers waterbed.
Put lighted EXIT signs on all your closets.
Rake your carpet (to clean up the clippings.)
Ride a loaf of bread.
See if you really can build a small nuclear device in your basement.
Speak in acronyms.
Take apart all your major kitchen appliances. Mix and match the parts.
Take your sofa for a walk.
Turn your TV picture tube upside down.
Wax the ceiling.
--------------------------------------pool------------------
Stand on top of the high board and say you won't come down until your demands are met.
Tell the lifeguards that they aren't doing their jobs because you have seen at least 15 people drown today.
Ask people if they have seen your pet shark.
Sit in the baby pool and play with the toys.
Take a flutter board and pretend you can't swim.
Hit strangers with your flutter board.
Ask an attractive lifeguard to practice CPR on you.
Sit in front of a water jet, make moaning sounds and say, "Oh yeah... oooh that feels soooo good....".
Sit on the top of the water slide and don't move.
Swim near a stranger and say, "Dammit I knew I shouldn't have had watermelon before I came here.".
Insist that you saw a monster at the bottom of the pool.
Pretend to drown and then when someone tries to help you, say, "HA-HA, fooled you!".
Scream as someone is trying to do something when jumping off of a diving board.
Laugh at fat people in swimsuits.
Tell people you saw the lifeguard pissing in the pool.
Ask a lifeguard if skinny-dipping is allowed.
Try to negotiate the price of getting in.
Take a really long time when you are on top of the high dive and then act as though you were pushed off.
When in line, ask strangers if they think invisible people get a discount.
Take your towel, tie it around your shoulders and say, "Wheee! I'm Batman!" while running around.
Hit strangers with your wet towel.
Throw people's things into the pool.
Sing and dance on top of the diving board, then do a belly-flop as your grande-finale.
Play Marco-Polo by yourself.
Ask small children if they have seen any suspicious-looking sea monsters lately.